GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
/*
 * Copyright (c) 2022-2024 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#define __STM32WB_BOOT_CODE__

#include "stm32wb_boot.h"
#include "stm32wb_fwu.h"
#include "stm32wb_rtc.h"
#include "stm32wb_gpio.h"
#include "stm32wb_system.h"

#define STM32WB_BOOT_FWU_CONFIG_APPLICATION 1 // allow APPLICATION updates via FWU
#define STM32WB_BOOT_FWU_CONFIG_WIRELESS    1 // allow WIRELESS updates via FWU
#define STM32WB_BOOT_FWU_CONFIG_SFLASH      1 // allow FWU area in SFLASH

#define STM32WB_BOOT_DFU_CONFIG_STANDALONE  1 // do not use the FWU path for DFU
#define STM32WB_BOOT_DFU_CONFIG_WIRELESS    1 // allow WIRELESS updates via DFU

/************************************************************************************************************************************/
static void __attribute__((noreturn)) stm32wb_boot_reset(void);
       void __attribute__((noreturn)) stm32wb_boot_enter(void);
static void __attribute__((noreturn)) stm32wb_boot_leave(uint32_t vtor_address);
static void __attribute__((noreturn)) stm32wb_boot_application(void);


static void stm32wb_boot_nmi(void);
static void stm32wb_boot_hardfault(void);
static void stm32wb_boot_svcall(void);
static void stm32wb_boot_pendsv(void);

static void stm32wb_boot_usbd_dcd_event(void);
static void stm32wb_boot_usbd_dcd_usb_interrupt(void);
static void stm32wb_boot_usbd_dcd_crs_interrupt(void);

/************************************************************************************************************************************/

static void stm32wb_boot_memset(void *d, uint8_t c, size_t n);
static void stm32wb_boot_memcpy(void *d, const void *s, size_t n);
static int stm32wb_boot_memcmp(const void *a, const void *b, size_t n);

/************************************************************************************************************************************/

static void stm32wb_boot_gpio_pin_configure(uint32_t pin, uint32_t mode);
static void stm32wb_boot_gpio_pin_input(uint32_t pin);
static void stm32wb_boot_gpio_pin_output(uint32_t pin);
static void stm32wb_boot_gpio_pin_alternate(uint32_t pin);
static void stm32wb_boot_gpio_pin_write(uint32_t pin, uint32_t data);
static uint32_t stm32wb_boot_gpio_pin_read(uint32_t pin);

/************************************************************************************************************************************/

#define STM32WB_FLASH_PAGE_SIZE 4096

#define STM32WB_BOOT_FLASH_ERASE_SIZE    4096
#define STM32WB_BOOT_FLASH_ERASE_TIME    22     // mS
#define STM32WB_BOOT_FLASH_PROGRAM_SIZE  512
#define STM32WB_BOOT_FLASH_PROGRAM_TIME  5200   // uS

static bool stm32wb_boot_flash_erase(uint32_t address);
static bool stm32wb_boot_flash_program(uint32_t address, const uint8_t *data, uint32_t count);

/************************************************************************************************************************************/

#if (STM32WB_BOOT_FWU_CONFIG_SFLASH == 1)

#define STM32WB_BOOT_SFLASH_BASE         0x00000000
#define STM32WB_BOOT_SFLASH_LIMIT        0x08000000

#define STM32WB_BOOT_SFLASH_FEATURE_QUAD 0x02

typedef struct _stm32wb_boot_sflash_info_t {
    uint8_t                        did[3];
    uint8_t                        features;
    uint32_t                       capacity;
    uint32_t                       erase_size;
    uint32_t                       page_size;
} stm32wb_boot_sflash_info_t;

static stm32wb_boot_sflash_info_t * stm32wb_boot_sflash_init(void);
static bool stm32wb_boot_sflash_erase(uint32_t address);
static void stm32wb_boot_sflash_program(uint32_t address, const uint8_t *data, uint32_t count);
static void stm32wb_boot_sflash_read(uint32_t address, uint8_t *data, uint32_t count);
static bool stm32wb_boot_sflash_verify(uint32_t address, const uint8_t *data, uint32_t count);

#endif /* (STM32WB_BOOT_FWU_CONFIG_SFLASH == 1) */

/************************************************************************************************************************************/

#define STM32WB_BOOT_NVM_PROGRAM_SIZE 512

static void stm32wb_boot_nvm_set_key(const uint32_t *key);
static bool stm32wb_boot_nvm_erase(uint32_t address);
static bool stm32wb_boot_nvm_program(uint32_t address, const uint8_t *data, uint32_t count, bool encrypted);
static void stm32wb_boot_nvm_read(uint32_t address, uint8_t *data, uint32_t count, bool encrypted);

/************************************************************************************************************************************/

static void stm32wb_boot_random(uint8_t *data, uint32_t count);

/************************************************************************************************************************************/

