GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
static uint32_t stm32wb_boot_crc32(const uint8_t *data, uint32_t size, uint32_t crc32);

/************************************************************************************************************************************/

#define SWAP(_x)      (uint32_t)((((_x) >> 24) & 0x000000ff) | (((_x) >> 8) & 0x0000ff00) | (((_x) << 8) & 0x00ff0000) |  (((_x) << 24) & 0xff000000))

#define STM32WB_BOOT_AES128_BLOCK_SIZE 16

typedef struct _stm32wb_boot_aes128_context_t {
    uint32_t                   K[4];
} stm32wb_boot_aes128_context_t;

typedef void (*stm32wb_boot_aes128_get_key_routine_t)(uint32_t *key);

static void stm32wb_boot_aes128_get_key(const uint32_t *nonce, uint32_t *key);
static void stm32wb_boot_aes128_set_key(stm32wb_boot_aes128_context_t *aes128_ctx, const uint32_t *key);
static void stm32wb_boot_aes128_ecb_encrypt(stm32wb_boot_aes128_context_t *aes128_ctx, const uint32_t *in, uint32_t *out, uint32_t count);
static void stm32wb_boot_aes128_ctr_encrypt(stm32wb_boot_aes128_context_t *aes128_ctx, const uint32_t *iv, const uint32_t *in, uint32_t *out, uint32_t count);

/************************************************************************************************************************************/

#define STM32WB_BOOT_SHA256_BLOCK_SIZE  64
#define STM32WB_BOOT_SHA256_HASH_SIZE   32    

#define STM32WB_BOOT_SHA256_NUM_BITS    256
#define STM32WB_BOOT_SHA256_NUM_BYTES   32
#define STM32WB_BOOT_SHA256_NUM_WORDS   8

typedef struct _stm32wb_boot_sha256_context_t {
    uint32_t                   hash[STM32WB_BOOT_SHA256_HASH_SIZE / 4];
    uint32_t                   length;
    uint32_t                   index;
    uint8_t                    data[STM32WB_BOOT_SHA256_BLOCK_SIZE];
} stm32wb_boot_sha256_context_t;

static void stm32wb_boot_sha256_init(stm32wb_boot_sha256_context_t *sha256_ctx);
static void stm32wb_boot_sha256_update(stm32wb_boot_sha256_context_t *sha256_ctx, const uint8_t *data, size_t size);
static void stm32wb_boot_sha256_final(stm32wb_boot_sha256_context_t *sha256_ctx, uint32_t *hash);

/************************************************************************************************************************************/

static bool stm32wb_boot_ecc256_verify(const stm32wb_boot_ecc256_key_t *key, const uint32_t *signature, const uint32_t *digest);

/************************************************************************************************************************************/

#if (STM32WB_BOOT_FWU_CONFIG_WIRELESS == 1) || (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1)

static uint32_t stm32wb_boot_fus_install(uint32_t image_base, uint32_t image_size);

#endif /* (STM32WB_BOOT_FWU_CONFIG_WIRELESS == 1) || (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1) */

/************************************************************************************************************************************/

#if (STM32WB_BOOT_FWU_CONFIG_APPLICATION == 1) || (STM32WB_BOOT_FWU_CONFIG_WIRELESS == 1)

static uint32_t stm32wb_boot_fwu_state(void);
static uint32_t stm32wb_boot_fwu_install(const stm32wb_application_info_t *application_info);
static void stm32wb_boot_fwu_rollback(uint32_t status);

#endif /* (STM32WB_BOOT_FWU_CONFIG_APPLICATION == 1) || (STM32WB_BOOT_FWU_CONFIG_WIRELESS == 1) */

/************************************************************************************************************************************/

static void __attribute__((noreturn)) stm32wb_boot_dfu(const stm32wb_application_info_t *application_info);

/************************************************************************************************************************************/

extern uint32_t __boot_data_start__[];
extern uint32_t __boot_data_end__[];
extern uint32_t __boot_data_flash__[];
extern uint32_t __boot_bss_start__[];
extern uint32_t __boot_bss_end__[];

static uint8_t __attribute__((section(".noinit"), aligned(4))) stm32wb_boot_io2_data[2048]; /* EP0_DATA, LZFWU_TEMP */
static uint8_t __attribute__((section(".noinit"), aligned(4))) stm32wb_boot_io8_data[8192]; /* DFU_DATA, LZFWU_DICT */

extern const stm32wb_boot_info_t stm32wb_boot_info;

static const __attribute__((used)) stm32wb_boot_ecc256_key_t stm32wb_boot_ecc256_key;

static const __attribute__((used)) stm32wb_boot_info_t __stm32wb_boot_info__ = { .version = STM32WB_BOOT_VERSION, .ecc256_key = (uint32_t)&stm32wb_boot_ecc256_key };

extern uint32_t stm32wb_boot_stack[];
extern const uint32_t stm32wb_boot_vectors[];

static uint8_t __attribute__((section(".stack"), used, aligned(32))) __stm32wb_boot_stack__[4096];

static const uint32_t __attribute__((used)) __stm32wb_boot_vectors__[16+64] =
{
    (uint32_t)stm32wb_boot_stack,                                /* Top of Stack */
    (uint32_t)stm32wb_boot_enter,                                /* Reset Handler */
    (uint32_t)stm32wb_boot_nmi,                                  /* NMI Handler */
    (uint32_t)stm32wb_boot_hardfault,                            /* Hard Fault Handler */
    0,                                                           /* MPU Fault Handler */
    0,                                                           /* Bus Fault Handler */
    0,                                                           /* Usage Fault Handler */
    0,                                                           /* Reserved */
    0x54561495,                                                  /* Reserved (magic) */
    STM32WB_BOOT_BASE,                                           /* Reserved (base) */
    STM32WB_BOOT_SIZE,                                           /* Reserved (size) */
    (uint32_t)stm32wb_boot_svcall,                               /* SVCall Handler */
    0,                                                           /* Debug Monitor Handler */
    (uint32_t)&stm32wb_boot_info - STM32WB_BOOT_BASE,            /* Reserved (offset) */
    (uint32_t)stm32wb_boot_pendsv,                               /* PendSV Handler */
    0,                                                           /* SysTick Handler */

