GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
    /* External interrupts */
    0,                                                           /* WWDG_IRQHandler */
    0,                                                           /* PVD_PVM_IRQHandler */
    0,                                                           /* TAMP_STAMP_LSECSS_IRQHandler */
    0,                                                           /* RTC_WKUP_IRQHandler */
    0,                                                           /* FLASH_IRQHandler */
    0,                                                           /* RCC_IRQHandler */
    0,                                                           /* EXTI0_IRQHandler */
    0,                                                           /* EXTI1_IRQHandler */
    0,                                                           /* EXTI2_IRQHandler */
    0,                                                           /* EXTI3_IRQHandler */
    0,                                                           /* EXTI4_IRQHandler */
    0,                                                           /* DMA1_Channel1_IRQHandler */
    0,                                                           /* DMA1_Channel2_IRQHandler */
    0,                                                           /* DMA1_Channel3_IRQHandler */
    0,                                                           /* DMA1_Channel4_IRQHandler */
    0,                                                           /* DMA1_Channel5_IRQHandler */
    0,                                                           /* DMA1_Channel6_IRQHandler */
    0,                                                           /* DMA1_Channel7_IRQHandler */
    0,                                                           /* ADC1_IRQHandler */
    0,                                                           /* USB_HP_IRQHandler */
    (uint32_t)stm32wb_boot_usbd_dcd_usb_interrupt,               /* USB_LP_IRQHandler */
    0,                                                           /* C2SEV_PWR_C2H_IRQHandler */
    0,                                                           /* COMP_IRQHandler */
    0,                                                           /* EXTI9_5_IRQHandler */
    0,                                                           /* TIM1_BRK_IRQHandler */
    0,                                                           /* TIM1_UP_TIM16_IRQHandler */
    0,                                                           /* TIM1_TRG_COM_TIM17_IRQHandler */
    0,                                                           /* TIM1_CC_IRQHandler */
    0,                                                           /* TIM2_IRQHandler */
    0,                                                           /* PKA_IRQHandler */
    0,                                                           /* I2C1_EV_IRQHandler */
    0,                                                           /* I2C1_ER_IRQHandler */
    0,                                                           /* I2C3_EV_IRQHandler */
    0,                                                           /* I2C3_ER_IRQHandler */
    0,                                                           /* SPI1_IRQHandler */
    0,                                                           /* SPI2_IRQHandler */
    0,                                                           /* USART1_IRQHandler */
    0,                                                           /* LPUART1_IRQHandler */
    0,                                                           /* SAI1_IRQHandler */
    0,                                                           /* TSC_IRQHandler */
    0,                                                           /* EXTI15_10_IRQHandler */
    0,                                                           /* RTC_Alarm_IRQHandler */
    (uint32_t)stm32wb_boot_usbd_dcd_crs_interrupt,               /* CRS_IRQHandler */
    0,                                                           /* PWR_SOTF_BLEACT_802ACT_RFPHASE_IRQHandler */
    0,                                                           /* IPCC_C1_RX_IRQHandler */
    0,                                                           /* IPCC_C1_TX_IRQHandler */
    0,                                                           /* HSEM_IRQHandler */
    0,                                                           /* LPTIM1_IRQHandler */
    0,                                                           /* LPTIM2_IRQHandler */
    0,                                                           /* LCD_IRQHandler */
    0,                                                           /* QUADSPI_IRQHandler */
    0,                                                           /* AES1_IRQHandler */
    0,                                                           /* AES2_IRQHandler */
    0,                                                           /* RNG_IRQHandler */
    0,                                                           /* FPU_IRQHandler */
    0,                                                           /* DMA2_Channel1_IRQHandler */
    0,                                                           /* DMA2_Channel2_IRQHandler */
    0,                                                           /* DMA2_Channel3_IRQHandler */
    0,                                                           /* DMA2_Channel4_IRQHandler */
    0,                                                           /* DMA2_Channel5_IRQHandler */
    0,                                                           /* DMA2_Channel6_IRQHandler */
    0,                                                           /* DMA2_Channel7_IRQHandler */
    0,                                                           /* DMAMUX1_OVR_IRQHandler */
};

/************************************************************************************************************************************/

static void __attribute__((noreturn, noinline)) stm32wb_boot_reset(void)
{
    SCB->AIRCR = 0x05fa0004;
    __DSB();
    __ISB();

    while (1)
    {
    }
}

void __attribute__((noreturn, noinline)) stm32wb_boot_enter(void)
{
    FLASH->ACR = FLASH_ACR_ICRST | FLASH_ACR_DCRST;
    FLASH->ACR = FLASH_ACR_ICEN | FLASH_ACR_DCEN | FLASH_ACR_LATENCY_3WS;
    FLASH->ACR;
    
    RCC->CR |= RCC_CR_HSION;
        
    while (!(RCC->CR & RCC_CR_HSIRDY))
    {
    }

