GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
    RCC->SMPSCR = (RCC->SMPSCR & ~RCC_SMPSCR_SMPSSEL) | RCC_SMPSCR_SMPSSEL_HSI;

    RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_HSI;
            
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSI)
    {
    }

    if ((PWR->CR1 & PWR_CR1_VOS) != PWR_CR1_VOS_RANGE_1)
    {
        PWR->CR1 = (PWR->CR1 & ~PWR_CR1_VOS) | PWR_CR1_VOS_RANGE_1;
            
        while (PWR->SR2 & PWR_SR2_VOSF)
        {
        }
    }

    RCC->CFGR = (RCC->CFGR & ~(RCC_CFGR_HPRE | RCC_CFGR_PPRE1 | RCC_CFGR_PPRE2 | RCC_CFGR_HPREF | RCC_CFGR_PPRE1F | RCC_CFGR_PPRE2F)) | (RCC_CFGR_HPRE_DIV1 | RCC_CFGR_PPRE1_DIV4 | RCC_CFGR_PPRE2_DIV2);

    while ((RCC->CFGR & (RCC_CFGR_HPREF | RCC_CFGR_PPRE1F | RCC_CFGR_PPRE2F)) != (RCC_CFGR_HPREF | RCC_CFGR_PPRE1F | RCC_CFGR_PPRE2F))
    {
    }

    RCC->EXTCFGR = (RCC->EXTCFGR & ~(RCC_EXTCFGR_SHDHPRE | RCC_EXTCFGR_C2HPRE | RCC_EXTCFGR_SHDHPREF | RCC_EXTCFGR_C2HPREF)) | RCC_EXTCFGR_SHDHPRE_DIV1 | RCC_EXTCFGR_C2HPRE_DIV2;
    
    while ((RCC->EXTCFGR & (RCC_EXTCFGR_SHDHPREF | RCC_EXTCFGR_C2HPREF)) != (RCC_EXTCFGR_SHDHPREF | RCC_EXTCFGR_C2HPREF))
    {
    }

    stm32wb_boot_application();
}

static void __attribute__((noreturn, noinline)) stm32wb_boot_leave(uint32_t vtor_address)
{
    register uint32_t stack_address __asm__("r0");
    register uint32_t entry_address __asm__("r1");
    register uint32_t zero_base __asm__("r2");
    register uint32_t zero_limit __asm__("r3");

    MPU->RBAR = 0x08000000 | MPU_RBAR_VALID_Msk | (0 << MPU_RBAR_REGION_Pos);
    MPU->RASR = MPU_RASR_XN_Msk | (1 << MPU_RASR_SRD_Pos) | (13 << MPU_RASR_SIZE_Pos) | MPU_RASR_ENABLE_Msk;
    MPU->CTRL = (MPU_CTRL_PRIVDEFENA_Msk | MPU_CTRL_HFNMIENA_Msk | MPU_CTRL_ENABLE_Msk);
    
    SCB->VTOR = vtor_address;
    
    __DSB();
    __ISB();
    
    stack_address = ((volatile uint32_t * volatile )vtor_address)[0];
    entry_address = ((volatile uint32_t * volatile )vtor_address)[1];
    
    zero_base  = (uint32_t)0x20000000;
    zero_limit = (uint32_t)0x20004000;
    
    __asm__ volatile (
        "   mov     sp, %0                                  \n"
        "   mov     lr, %1                                  \n"
        "   movs    %0, #0                                  \n"
        "   movs    %1, #0                                  \n"
        "1: strd    %0, %1, [%2], #4                        \n"
        "   cmp     %2, %3                                  \n"
        "   bne     1b                                      \n"
        "   mov     r2, r0                                  \n"
        "   mov     r3, r1                                  \n"
        "   mov     r4, r2                                  \n"
        "   mov     r5, r2                                  \n"
        "   mov     r6, r2                                  \n"
        "   mov     r7, r2                                  \n"
        "   mov     r8, r2                                  \n"
        "   mov     r9, r2                                  \n"
        "   mov     r10, r2                                 \n"
        "   mov     r11, r2                                 \n"
        "   mov     r12, r2                                 \n"
        "   bx      lr                                      \n"
        :
        : "l" (stack_address), "l" (entry_address), "l" (zero_base), "l" (zero_limit)
        );
    
    while (1)
    {
    }
}

/************************************************************************************************************************************/

static void __attribute__((noinline)) stm32wb_boot_nmi(void)
{
    while (1)
    {
        __WFE();
    }
}

static void __attribute__((noinline)) stm32wb_boot_hardfault(void)
{
    while (1)
    {
        __WFE();
    }
}

static void __attribute__((naked, noinline)) stm32wb_boot_svcall(void)
{
    __asm__(
        "   mov     r2, sp                                  \n"
        "   push    { r2, lr }                              \n"
        "   ldmia   r2, { r0, r1, r2, r3 }                  \n"
        "   blx     r7                                      \n"
        "   pop     { r2, r3 }                              \n"
        "   str     r0, [r2, #0]                            \n"
        "   bx      r3                                      \n"
        :
        :
        );
}

static void __attribute__((noinline)) stm32wb_boot_pendsv(void)
{
    stm32wb_boot_usbd_dcd_event();
}

/************************************************************************************************************************************/

static void __attribute__((naked, noinline)) stm32wb_boot_memset(void *d, uint8_t c, size_t n)
{
    __asm__(
        "   cmp     r2, #16                                 \n"
        "   bls     2f                                      \n"
        "   lsls    r3, r0, #30                             \n"
        "   bne     2f                                      \n"
        "   uxtb    r1, r1                                  \n"
	"   orr     r1, r1, r1, lsl #8                      \n"
	"   orr     r1, r1, r1, lsl #16                     \n"
        "   bic     r3, r2, #3                              \n"
        "   add     r3, r0                                  \n"
        "1: str     r1, [r0], #4                            \n"
        "   cmp     r3, r0                                  \n"
        "   bne     1b                                      \n"
        "   lsrs    r3, r2, #2                              \n"
        "   it      cs                                      \n"
        "   strhcs  r1, [r0], #2                            \n"
        "   lsrs    r3, r2, #1                              \n"
        "   it      cs                                      \n"
        "   strbcs  r1, [r0], #1                            \n"
        "   bx      lr                                      \n"
        "2: cbz     r2, 4f                                  \n"
        "   add     r2, r0                                  \n"
        "3: strb    r1, [r0], #1                            \n"
        "   cmp     r2, r0                                  \n"
        "   bne     3b                                      \n"
        "4: bx      lr                                      \n"
        );
}

static void __attribute__((naked, noinline)) stm32wb_boot_memcpy(void *d, const void *s, size_t n)
{
    __asm__(
        "   cmp     r2, #16                                 \n"
        "   bls     2f                                      \n"
        "   lsls    r3, r0, #30                             \n"
        "   bne     2f                                      \n"
        "   bic     r3, r2, #3                              \n"
        "   add     r3, r0                                  \n"
        "1: ldr     r12, [r1], #4                           \n"
        "   str     r12, [r0], #4                           \n"
        "   cmp     r3, r0                                  \n"
        "   bne     1b                                      \n"
        "   lsrs    r3, r2, #2                              \n"
        "   itt     cs                                      \n"
        "   ldrhcs  r12, [r1], #2                           \n"
        "   strhcs  r12, [r0], #2                           \n"
        "   lsrs    r3, r2, #1                              \n"
        "   itt     cs                                      \n"
        "   ldrbcs  r12, [r1], #1                           \n"
        "   strbcs  r12, [r0], #1                           \n"
        "   bx      lr                                      \n"
        "2: cbz     r2, 4f                                  \n"
        "   add     r2, r0                                  \n"
        "3: ldrb    r12, [r1], #1                           \n"
        "   strb    r12, [r0], #1                           \n"
        "   cmp     r2, r0                                  \n"
        "   bne     3b                                      \n"
        "4: bx      lr                                      \n"
        );
}

