GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
static int __attribute__((noinline)) stm32wb_boot_memcmp(const void *a, const void *b, size_t n)
{
    size_t i;
    
    if (n)
    {
        for (i = 0; i < n; i++)
        {
            if (((const uint8_t*)a)[i] != ((const uint8_t*)b)[i])
            {
                return (((const uint8_t*)a)[i] - ((const uint8_t*)b)[i]);
            }
        }
    }

    return 0;
}
/************************************************************************************************************************************/

#define armv7m_atomic_and              stm32wb_boot_atomic_and
#define armv7m_atomic_andh             stm32wb_boot_atomic_andh
#define armv7m_atomic_or               stm32wb_boot_atomic_or
#define armv7m_atomic_orh              stm32wb_boot_atomic_orh 
#define armv7m_atomic_swap             stm32wb_boot_atomic_swap
#define armv7m_atomic_swapb            stm32wb_boot_atomic_swapb

static uint32_t __attribute__((noinline)) stm32wb_boot_atomic_and(volatile uint32_t *p_data, uint32_t data)
{
    return __armv7m_atomic_and(p_data, data);
}

static uint32_t __attribute__((noinline)) stm32wb_boot_atomic_andh(volatile uint16_t *p_data, uint32_t data)
{
    return __armv7m_atomic_andh(p_data, data);
}

static uint32_t __attribute__((noinline)) stm32wb_boot_atomic_or(volatile uint32_t *p_data, uint32_t data)
{
    return __armv7m_atomic_or(p_data, data);
}

static uint32_t __attribute__((noinline)) stm32wb_boot_atomic_orh(volatile uint16_t *p_data, uint32_t data)
{
    return __armv7m_atomic_orh(p_data, data);
}

static uint32_t __attribute__((noinline)) stm32wb_boot_atomic_swap(volatile uint32_t *p_data, uint32_t data)
{
    return __armv7m_atomic_swap(p_data, data);
}

static uint32_t __attribute__((noinline)) stm32wb_boot_atomic_swapb(volatile uint8_t *p_data, uint32_t data)
{
    return __armv7m_atomic_swapb(p_data, data);
}

/************************************************************************************************************************************/

#define armv7m_core_udelay             stm32wb_boot_udelay

static void __attribute__((noinline)) stm32wb_boot_udelay(uint32_t delay)
{
    uint32_t n;

    n = (delay * (64000000 / 15625) + 255) / 256;

    __asm__ __volatile__(
                         "1: subs %0, #1 \n"
                         "   nop         \n"
                         "   bne  1b     \n"
                         : "+r" (n));
}

/************************************************************************************************************************************/

static void __attribute__((noinline)) stm32wb_boot_gpio_pin_configure(uint32_t pin, uint32_t mode)
{
    GPIO_TypeDef *GPIO;
    uint32_t group, index, afsel, mask, index_2, mask_2;

    afsel = (pin >> 8) & 15;
    group = (pin >> 4) & 15;
    index = (pin >> 0) & 15;

    mask = (1 << index);
    index_2 = (index * 2);
    mask_2 = (3 << index_2);
    
    GPIO = (GPIO_TypeDef *)(GPIOA_BASE + (GPIOB_BASE - GPIOA_BASE) * group);

    RCC->AHB2ENR |= (RCC_AHB2ENR_GPIOAEN << group);
    RCC->AHB2ENR;

    /* If the mode is ANALOG, set MODER first */
    if ((mode & STM32WB_GPIO_MODE_MASK) == STM32WB_GPIO_MODE_ANALOG)
    {
        GPIO->MODER = (GPIO->MODER & ~mask_2) | ((STM32WB_GPIO_MODE_ANALOG >> STM32WB_GPIO_MODE_SHIFT) << index_2);
    }

    /* Set AFRL/AFRH */
    GPIO->AFR[index >> 3] = (GPIO->AFR[index >> 3] & ~(15 << ((index & 7) << 2))) | (afsel << ((index & 7) << 2));
        
    /* Set OPTYPER */
    GPIO->OTYPER = (GPIO->OTYPER & ~mask) | (((mode & STM32WB_GPIO_OTYPE_MASK) >> STM32WB_GPIO_OTYPE_SHIFT) << index);
    
    /* Set OPSPEEDR */
    GPIO->OSPEEDR = (GPIO->OSPEEDR & ~mask_2) | (((mode & STM32WB_GPIO_OSPEED_MASK) >> STM32WB_GPIO_OSPEED_SHIFT) << index_2);

    if (mode & STM32WB_GPIO_ODATA_0)
    {
        GPIO->BRR = mask;
    }
    
    if (mode & STM32WB_GPIO_ODATA_1)
    {
        GPIO->BSRR = mask;
    }
    
    /* Set MODE */
    GPIO->MODER = (GPIO->MODER & ~mask_2) | (((mode & STM32WB_GPIO_MODE_MASK) >> STM32WB_GPIO_MODE_SHIFT) << index_2);
        
    /* Set PUPD */
    GPIO->PUPDR = (GPIO->PUPDR & ~mask_2) | (((mode & STM32WB_GPIO_PUPD_MASK) >> STM32WB_GPIO_PUPD_SHIFT) << index_2);
}

static void __attribute__((noinline)) stm32wb_boot_gpio_pin_input(uint32_t pin)
{
    GPIO_TypeDef *GPIO;
    uint32_t group, index, index_2, mask_2;

    group = (pin >> 4) & 7;
    index = (pin >> 0) & 15;

    index_2 = (index * 2);
    mask_2 = (3 << index_2);
    
    GPIO = (GPIO_TypeDef *)(GPIOA_BASE + (GPIOB_BASE - GPIOA_BASE) * group);

    GPIO->MODER = (GPIO->MODER & ~mask_2) | ((STM32WB_GPIO_MODE_INPUT >> STM32WB_GPIO_MODE_SHIFT) << index_2);
}

static void __attribute__((noinline)) stm32wb_boot_gpio_pin_output(uint32_t pin)
{
    GPIO_TypeDef *GPIO;
    uint32_t group, index, index_2, mask_2;

    group = (pin >> 4) & 7;
    index = (pin >> 0) & 15;

    index_2 = (index * 2);
    mask_2 = (3 << index_2);
    
    GPIO = (GPIO_TypeDef *)(GPIOA_BASE + (GPIOB_BASE - GPIOA_BASE) * group);

    GPIO->MODER = (GPIO->MODER & ~mask_2) | ((STM32WB_GPIO_MODE_OUTPUT >> STM32WB_GPIO_MODE_SHIFT) << index_2);
}

static void __attribute__((noinline)) stm32wb_boot_gpio_pin_alternate(uint32_t pin)
{
    GPIO_TypeDef *GPIO;
    uint32_t group, index, index_2, mask_2;

    group = (pin >> 4) & 7;
    index = (pin >> 0) & 15;

    index_2 = (index * 2);
    mask_2 = (3 << index_2);
    
    GPIO = (GPIO_TypeDef *)(GPIOA_BASE + (GPIOB_BASE - GPIOA_BASE) * group);

    GPIO->MODER = (GPIO->MODER & ~mask_2) | ((STM32WB_GPIO_MODE_ALTERNATE >> STM32WB_GPIO_MODE_SHIFT) << index_2);
}

static void __attribute__((noinline, optimize("O3"))) stm32wb_boot_gpio_pin_write(uint32_t pin, uint32_t data)
{
    GPIO_TypeDef *GPIO;
    uint32_t group, index;

    group = (pin & STM32WB_GPIO_PIN_GROUP_MASK) >> STM32WB_GPIO_PIN_GROUP_SHIFT;
    index = (pin & STM32WB_GPIO_PIN_INDEX_MASK) >> STM32WB_GPIO_PIN_INDEX_SHIFT;

    GPIO = (GPIO_TypeDef *)(GPIOA_BASE + (GPIOB_BASE - GPIOA_BASE) * group);

    if (data)
    {
        GPIO->BSRR = (1 << index);
    }
    else
    {
        GPIO->BRR = (1 << index);
    }
}

static uint32_t __attribute__((noinline, optimize("O3"))) stm32wb_boot_gpio_pin_read(uint32_t pin)
{
    GPIO_TypeDef *GPIO;
    uint32_t group, index;

    group = (pin & STM32WB_GPIO_PIN_GROUP_MASK) >> STM32WB_GPIO_PIN_GROUP_SHIFT;
    index = (pin & STM32WB_GPIO_PIN_INDEX_MASK) >> STM32WB_GPIO_PIN_INDEX_SHIFT;

    GPIO = (GPIO_TypeDef *)(GPIOA_BASE + (GPIOB_BASE - GPIOA_BASE) * group);

    return ((GPIO->IDR >> index) & 1);
}

/************************************************************************************************************************************/

static bool __attribute__((noinline)) stm32wb_boot_flash_erase(uint32_t address)
{
    uint32_t flash_sr, flash_acr;

    FLASH->KEYR = 0x45670123;
    FLASH->KEYR = 0xcdef89ab;
    
    FLASH->SR = (FLASH_SR_EOP | FLASH_SR_OPERR | FLASH_SR_PROGERR | FLASH_SR_WRPERR | FLASH_SR_PGAERR | FLASH_SR_SIZERR | FLASH_SR_PGSERR | FLASH_SR_MISERR | FLASH_SR_FASTERR);
    FLASH->CR = FLASH_CR_STRT | FLASH_CR_PER | (((address - FLASH_BASE) / STM32WB_FLASH_PAGE_SIZE) << 3);

    do
    {
        flash_sr = FLASH->SR;
    }
    while (flash_sr & FLASH_SR_BSY);

    FLASH->CR = FLASH_CR_LOCK;
    
    if (flash_sr & (FLASH_SR_PROGERR | FLASH_SR_WRPERR | FLASH_SR_PGAERR | FLASH_SR_SIZERR | FLASH_SR_PGSERR | FLASH_SR_MISERR | FLASH_SR_FASTERR))
    {
        return false;
    }

    flash_acr = FLASH->ACR;

    FLASH->ACR = flash_acr & ~(FLASH_ACR_ICEN | FLASH_ACR_DCEN);
    FLASH->ACR = (flash_acr & ~(FLASH_ACR_ICEN | FLASH_ACR_DCEN)) | (FLASH_ACR_ICRST | FLASH_ACR_DCRST);
    FLASH->ACR = flash_acr;
    
