GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
    return true;
}

static bool stm32wb_boot_flash_program(uint32_t address, const uint8_t *data, uint32_t count)
{
    uint32_t flash_sr, flash_acr, data_0, data_1;
    bool success = true;

    FLASH->KEYR = 0x45670123;
    FLASH->KEYR = 0xcdef89ab;
    
    FLASH->SR = (FLASH_SR_EOP | FLASH_SR_OPERR | FLASH_SR_PROGERR | FLASH_SR_WRPERR | FLASH_SR_PGAERR | FLASH_SR_SIZERR | FLASH_SR_PGSERR | FLASH_SR_MISERR | FLASH_SR_FASTERR);
    FLASH->CR = FLASH_CR_PG;

    for (; count; address += 8, data += 8, count -= 8)
    {
        data_0 = ((const uint32_t*)data)[0];
        data_1 = ((const uint32_t*)data)[1];

        __asm__ volatile("": : : "memory");
        
        ((volatile uint32_t*)address)[0] = data_0;
        ((volatile uint32_t*)address)[1] = data_1;
        
        do
        {
            flash_sr = FLASH->SR;
        }
        while (flash_sr & FLASH_SR_BSY);

        if (flash_sr & (FLASH_SR_PROGERR | FLASH_SR_WRPERR | FLASH_SR_PGAERR | FLASH_SR_SIZERR | FLASH_SR_PGSERR | FLASH_SR_MISERR | FLASH_SR_FASTERR))
        {
            success = false;

            break;
        }
    }
    
    FLASH->CR = FLASH_CR_LOCK;
    
    flash_acr = FLASH->ACR;

    FLASH->ACR = flash_acr & ~(FLASH_ACR_ICEN | FLASH_ACR_DCEN);
    FLASH->ACR = (flash_acr & ~(FLASH_ACR_ICEN | FLASH_ACR_DCEN)) | (FLASH_ACR_ICRST | FLASH_ACR_DCRST);
    FLASH->ACR = flash_acr;
    
    return success;
}

/************************************************************************************************************************************/

#if (STM32WB_BOOT_FWU_CONFIG_SFLASH == 1)

#define QSPI_CCR_SDR                               (0)
#define QSPI_CCR_DDR                               QUADSPI_CCR_DDRM
#define QSPI_CCR_FMODE_MASK                        QUADSPI_CCR_FMODE_Msk
#define QSPI_CCR_FMODE_SHIFT                       QUADSPI_CCR_FMODE_Pos
#define QSPI_CCR_FMODE_WRITE                       (0)
#define QSPI_CCR_FMODE_READ                        (QUADSPI_CCR_FMODE_0)
#define QSPI_CCR_FMODE_WAIT                        (QUADSPI_CCR_FMODE_1)
#define QSPI_CCR_DMODE_MASK                        QUADSPI_CCR_DMODE_Msk
#define QSPI_CCR_DMODE_SHIFT                       QUADSPI_CCR_DMODE_Pos
#define QSPI_CCR_DMODE_NONE                        (0)
#define QSPI_CCR_DMODE_SINGLE                      (QUADSPI_CCR_DMODE_0)
#define QSPI_CCR_DMODE_DUAL                        (QUADSPI_CCR_DMODE_1)
#define QSPI_CCR_DMODE_QUAD                        (QUADSPI_CCR_DMODE_1 | QUADSPI_CCR_DMODE_0)
#define QSPI_CCR_DCYCLE(_n)                        (((_n) << QUADSPI_CCR_DCYC_Pos) & QUADSPI_CCR_DCYC_Msk)
#define QSPI_CCR_ABSIZE_MASK                       QUADSPI_CCR_ABSIZE_Msk
#define QSPI_CCR_ABSIZE_SHIFT                      QUADSPI_CCR_ABSIZE_Pos
#define QSPI_CCR_ABSIZE_8                          (0)
#define QSPI_CCR_ABSIZE_16                         (QUADSPI_CCR_ABSIZE_0)
#define QSPI_CCR_ABSIZE_24                         (QUADSPI_CCR_ABSIZE_1)
#define QSPI_CCR_ABSIZE_32                         (QUADSPI_CCR_ABSIZE_1 | QUADSPI_CCR_ABSIZE_0)
#define QSPI_CCR_ABMODE_MASK                       QUADSPI_CCR_ABMODE_Msk
#define QSPI_CCR_ABMODE_SHIFT                      QUADSPI_CCR_ABMODE_Pos
#define QSPI_CCR_ABMODE_NONE                       (0)
#define QSPI_CCR_ABMODE_SINGLE                     (QUADSPI_CCR_ABMODE_0)
#define QSPI_CCR_ABMODE_DUAL                       (QUADSPI_CCR_ABMODE_1)
#define QSPI_CCR_ABMODE_QUAD                       (QUADSPI_CCR_ABMODE_1 | QUADSPI_CCR_ABMODE_0)
#define QSPI_CCR_ABMODE_DUAL_8                     (QSPI_CCR_ABMODE_DUAL | QSPI_CCR_ABSIZE_8)
#define QSPI_CCR_ABMODE_DUAL_16                    (QSPI_CCR_ABMODE_DUAL | QSPI_CCR_ABSIZE_16)
#define QSPI_CCR_ABMODE_DUAL_24                    (QSPI_CCR_ABMODE_DUAL | QSPI_CCR_ABSIZE_24)
#define QSPI_CCR_ABMODE_DUAL_32                    (QSPI_CCR_ABMODE_DUAL | QSPI_CCR_ABSIZE_32)
#define QSPI_CCR_ABMODE_QUAD_8                     (QSPI_CCR_ABMODE_QUAD | QSPI_CCR_ABSIZE_8)
#define QSPI_CCR_ABMODE_QUAD_16                    (QSPI_CCR_ABMODE_QUAD | QSPI_CCR_ABSIZE_16)
#define QSPI_CCR_ABMODE_QUAD_24                    (QSPI_CCR_ABMODE_QUAD | QSPI_CCR_ABSIZE_24)
#define QSPI_CCR_ABMODE_QUAD_32                    (QSPI_CCR_ABMODE_QUAD | QSPI_CCR_ABSIZE_32)
#define QSPI_CCR_ADSIZE_MASK                       QUADSPI_CCR_ADSIZE_Msk
#define QSPI_CCR_ADSIZE_SHIFT                      QUADSPI_CCR_ADSIZE_Pos
#define QSPI_CCR_ADSIZE_16                         (QUADSPI_CCR_ADSIZE_0)
#define QSPI_CCR_ADSIZE_8                          (0)
#define QSPI_CCR_ADSIZE_16                         (QUADSPI_CCR_ADSIZE_0)
#define QSPI_CCR_ADSIZE_24                         (QUADSPI_CCR_ADSIZE_1)
#define QSPI_CCR_ADSIZE_32                         (QUADSPI_CCR_ADSIZE_1 | QUADSPI_CCR_ADSIZE_0)
#define QSPI_CCR_ADMODE_MASK                       QUADSPI_CCR_ADMODE_Msk
#define QSPI_CCR_ADMODE_SHIFT                      QUADSPI_CCR_ADMODE_Pos
#define QSPI_CCR_ADMODE_NONE                       (0)
#define QSPI_CCR_ADMODE_SINGLE                     (QUADSPI_CCR_ADMODE_0)
#define QSPI_CCR_ADMODE_DUAL                       (QUADSPI_CCR_ADMODE_1)
#define QSPI_CCR_ADMODE_QUAD                       (QUADSPI_CCR_ADMODE_1 | QUADSPI_CCR_ADMODE_0)
#define QSPI_CCR_ADMODE_SINGLE_8                   (QSPI_CCR_ADMODE_SINGLE | QSPI_CCR_ADSIZE_8)
#define QSPI_CCR_ADMODE_SINGLE_16                  (QSPI_CCR_ADMODE_SINGLE | QSPI_CCR_ADSIZE_16)
#define QSPI_CCR_ADMODE_SINGLE_24                  (QSPI_CCR_ADMODE_SINGLE | QSPI_CCR_ADSIZE_24)
#define QSPI_CCR_ADMODE_SINGLE_32                  (QSPI_CCR_ADMODE_SINGLE | QSPI_CCR_ADSIZE_32)
#define QSPI_CCR_ADMODE_DUAL_8                     (QSPI_CCR_ADMODE_DUAL | QSPI_CCR_ADSIZE_8)
#define QSPI_CCR_ADMODE_DUAL_16                    (QSPI_CCR_ADMODE_DUAL | QSPI_CCR_ADSIZE_16)
#define QSPI_CCR_ADMODE_DUAL_24                    (QSPI_CCR_ADMODE_DUAL | QSPI_CCR_ADSIZE_24)
#define QSPI_CCR_ADMODE_DUAL_32                    (QSPI_CCR_ADMODE_DUAL | QSPI_CCR_ADSIZE_32)
#define QSPI_CCR_ADMODE_QUAD_8                     (QSPI_CCR_ADMODE_QUAD | QSPI_CCR_ADSIZE_8)
#define QSPI_CCR_ADMODE_QUAD_16                    (QSPI_CCR_ADMODE_QUAD | QSPI_CCR_ADSIZE_16)
#define QSPI_CCR_ADMODE_QUAD_24                    (QSPI_CCR_ADMODE_QUAD | QSPI_CCR_ADSIZE_24)
#define QSPI_CCR_ADMODE_QUAD_32                    (QSPI_CCR_ADMODE_SINGLE | QSPI_CCR_ADSIZE_32)
#define QSPI_CCR_IMODE_NONE                        (0)
#define QSPI_CCR_IMODE_SINGLE                      (QUADSPI_CCR_IMODE_0)
#define QSPI_CCR_IMODE_DUAL                        (QUADSPI_CCR_IMODE_1)
#define QSPI_CCR_IMODE_QUAD                        (QUADSPI_CCR_IMODE_1 | QUADSPI_CCR_IMODE_0)

#define STM32WB_BOOT_QSPI_MID_SPANSION             0x01
#define STM32WB_BOOT_QSPI_MID_MACRONIX             0xc2
#define STM32WB_BOOT_QSPI_MID_WINBOND              0xef

#define STM32WB_BOOT_QSPI_CCR_COMMAND              (QSPI_CCR_SDR | QSPI_CCR_FMODE_WRITE | QSPI_CCR_DMODE_NONE   | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_NONE      | QSPI_CCR_IMODE_SINGLE)
#define STM32WB_BOOT_QSPI_CCR_COMMAND_STATUS       (QSPI_CCR_SDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_SINGLE | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_NONE      | QSPI_CCR_IMODE_SINGLE)
#define STM32WB_BOOT_QSPI_CCR_COMMAND_WRITE_1      (QSPI_CCR_SDR | QSPI_CCR_FMODE_WRITE | QSPI_CCR_DMODE_NONE   | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_SINGLE_8  | QSPI_CCR_IMODE_SINGLE)
#define STM32WB_BOOT_QSPI_CCR_COMMAND_WRITE_2      (QSPI_CCR_SDR | QSPI_CCR_FMODE_WRITE | QSPI_CCR_DMODE_NONE   | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_SINGLE_16 | QSPI_CCR_IMODE_SINGLE)
#define STM32WB_BOOT_QSPI_CCR_COMMAND_WRITE_3      (QSPI_CCR_SDR | QSPI_CCR_FMODE_WRITE | QSPI_CCR_DMODE_NONE   | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_SINGLE_24 | QSPI_CCR_IMODE_SINGLE)
#define STM32WB_BOOT_QSPI_CCR_COMMAND_WRITE_4      (QSPI_CCR_SDR | QSPI_CCR_FMODE_WRITE | QSPI_CCR_DMODE_NONE   | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_SINGLE_32 | QSPI_CCR_IMODE_SINGLE)
#define STM32WB_BOOT_QSPI_CCR_COMMAND_READ         (QSPI_CCR_SDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_SINGLE | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_NONE      | QSPI_CCR_IMODE_SINGLE)
#define STM32WB_BOOT_QSPI_CCR_COMMAND_QPI          (QSPI_CCR_SDR | QSPI_CCR_FMODE_WRITE | QSPI_CCR_DMODE_NONE   | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_NONE      | QSPI_CCR_IMODE_QUAD  )
#define STM32WB_BOOT_QSPI_CCR_COMMAND_QPI_STATUS   (QSPI_CCR_SDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_QUAD   | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_NONE      | QSPI_CCR_IMODE_QUAD  )
#define STM32WB_BOOT_QSPI_CCR_COMMAND_QPI_WRITE_1  (QSPI_CCR_SDR | QSPI_CCR_FMODE_WRITE | QSPI_CCR_DMODE_NONE   | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_QUAD_8    | QSPI_CCR_IMODE_QUAD  )
#define STM32WB_BOOT_QSPI_CCR_COMMAND_QPI_WRITE_2  (QSPI_CCR_SDR | QSPI_CCR_FMODE_WRITE | QSPI_CCR_DMODE_NONE   | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_QUAD_16   | QSPI_CCR_IMODE_QUAD  )
#define STM32WB_BOOT_QSPI_CCR_COMMAND_QPI_WRITE_3  (QSPI_CCR_SDR | QSPI_CCR_FMODE_WRITE | QSPI_CCR_DMODE_NONE   | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_QUAD_24   | QSPI_CCR_IMODE_QUAD  )
#define STM32WB_BOOT_QSPI_CCR_COMMAND_QPI_WRITE_4  (QSPI_CCR_SDR | QSPI_CCR_FMODE_WRITE | QSPI_CCR_DMODE_NONE   | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_QUAD_32   | QSPI_CCR_IMODE_QUAD  )

#define STM32WB_BOOT_QSPI_CCR_RDID                 (QSPI_CCR_SDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_SINGLE | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_NONE      | QSPI_CCR_IMODE_SINGLE | 0x9f)
#define STM32WB_BOOT_QSPI_CCR_RDSFDP               (QSPI_CCR_SDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_SINGLE | QSPI_CCR_DCYCLE(8) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_SINGLE_24 | QSPI_CCR_IMODE_SINGLE | 0x5a)

#define STM32WB_BOOT_QSPI_CCR_ERASE_64K            (QSPI_CCR_SDR | QSPI_CCR_FMODE_WRITE | QSPI_CCR_DMODE_NONE   | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_SINGLE_24 | QSPI_CCR_IMODE_SINGLE | 0xd8)
#define STM32WB_BOOT_QSPI_CCR_ERASE_4K             (QSPI_CCR_SDR | QSPI_CCR_FMODE_WRITE | QSPI_CCR_DMODE_NONE   | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_SINGLE_24 | QSPI_CCR_IMODE_SINGLE | 0x20)
#define STM32WB_BOOT_QSPI_CCR_PROGRAM_1_1_1        (QSPI_CCR_SDR | QSPI_CCR_FMODE_WRITE | QSPI_CCR_DMODE_SINGLE | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_SINGLE_24 | QSPI_CCR_IMODE_SINGLE | 0x02)
#define STM32WB_BOOT_QSPI_CCR_PROGRAM_1_1_4        (QSPI_CCR_SDR | QSPI_CCR_FMODE_WRITE | QSPI_CCR_DMODE_QUAD   | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_SINGLE_24 | QSPI_CCR_IMODE_SINGLE | 0x32)
#define STM32WB_BOOT_QSPI_CCR_PROGRAM_1_4_4        (QSPI_CCR_SDR | QSPI_CCR_FMODE_WRITE | QSPI_CCR_DMODE_QUAD   | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_QUAD_24   | QSPI_CCR_IMODE_SINGLE | 0x38)
#define STM32WB_BOOT_QSPI_CCR_PROGRAM_4_4_4        (QSPI_CCR_SDR | QSPI_CCR_FMODE_WRITE | QSPI_CCR_DMODE_QUAD   | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_QUAD_24   | QSPI_CCR_IMODE_QUAD   | 0x02)
#define STM32WB_BOOT_QSPI_CCR_READ_1_1_1           (QSPI_CCR_SDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_SINGLE | QSPI_CCR_DCYCLE(0) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_SINGLE_24 | QSPI_CCR_IMODE_SINGLE | 0x03)
#define STM32WB_BOOT_QSPI_CCR_READ_1_1_1_D8        (QSPI_CCR_SDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_SINGLE | QSPI_CCR_DCYCLE(8) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_SINGLE_24 | QSPI_CCR_IMODE_SINGLE | 0x0b)
#define STM32WB_BOOT_QSPI_CCR_READ_1_1_2_D8        (QSPI_CCR_SDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_DUAL   | QSPI_CCR_DCYCLE(8) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_SINGLE_24 | QSPI_CCR_IMODE_SINGLE | 0x3b)
#define STM32WB_BOOT_QSPI_CCR_READ_1_1_4_D8        (QSPI_CCR_SDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_QUAD   | QSPI_CCR_DCYCLE(8) | QSPI_CCR_ABMODE_NONE    | QSPI_CCR_ADMODE_SINGLE_24 | QSPI_CCR_IMODE_SINGLE | 0x6b)
#define STM32WB_BOOT_QSPI_CCR_READ_1_2_2_M2D2      (QSPI_CCR_SDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_DUAL   | QSPI_CCR_DCYCLE(2) | QSPI_CCR_ABMODE_QUAD_8  | QSPI_CCR_ADMODE_DUAL_24   | QSPI_CCR_IMODE_SINGLE | 0xbb)
#define STM32WB_BOOT_QSPI_CCR_READ_1_2_2_M2D2_DTR  (QSPI_CCR_DDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_DUAL   | QSPI_CCR_DCYCLE(2) | QSPI_CCR_ABMODE_QUAD_16 | QSPI_CCR_ADMODE_DUAL_24   | QSPI_CCR_IMODE_SINGLE | 0xbd)
#define STM32WB_BOOT_QSPI_CCR_READ_1_2_2_M2D4_DTR  (QSPI_CCR_DDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_DUAL   | QSPI_CCR_DCYCLE(4) | QSPI_CCR_ABMODE_QUAD_16 | QSPI_CCR_ADMODE_DUAL_24   | QSPI_CCR_IMODE_SINGLE | 0xbd)
#define STM32WB_BOOT_QSPI_CCR_READ_1_4_4_M2D4      (QSPI_CCR_SDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_QUAD   | QSPI_CCR_DCYCLE(4) | QSPI_CCR_ABMODE_QUAD_8  | QSPI_CCR_ADMODE_QUAD_24   | QSPI_CCR_IMODE_SINGLE | 0xeb)
#define STM32WB_BOOT_QSPI_CCR_READ_1_4_4_M2D4_DTR  (QSPI_CCR_DDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_QUAD   | QSPI_CCR_DCYCLE(4) | QSPI_CCR_ABMODE_QUAD_16 | QSPI_CCR_ADMODE_QUAD_24   | QSPI_CCR_IMODE_SINGLE | 0xed)
#define STM32WB_BOOT_QSPI_CCR_READ_1_4_4_M2D6_DTR  (QSPI_CCR_DDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_QUAD   | QSPI_CCR_DCYCLE(6) | QSPI_CCR_ABMODE_QUAD_16 | QSPI_CCR_ADMODE_QUAD_24   | QSPI_CCR_IMODE_SINGLE | 0xed)
#define STM32WB_BOOT_QSPI_CCR_READ_4_4_4_D2        (QSPI_CCR_SDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_QUAD   | QSPI_CCR_DCYCLE(2) | QSPI_CCR_ABMODE_QUAD_8  | QSPI_CCR_ADMODE_QUAD_24   | QSPI_CCR_IMODE_QUAD   | 0x0b)
#define STM32WB_BOOT_QSPI_CCR_READ_4_4_4_M2D4      (QSPI_CCR_SDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_QUAD   | QSPI_CCR_DCYCLE(4) | QSPI_CCR_ABMODE_QUAD_8  | QSPI_CCR_ADMODE_QUAD_24   | QSPI_CCR_IMODE_QUAD   | 0xeb)
#define STM32WB_BOOT_QSPI_CCR_READ_4_4_4_M2D4_DTR  (QSPI_CCR_DDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_QUAD   | QSPI_CCR_DCYCLE(4) | QSPI_CCR_ABMODE_QUAD_16 | QSPI_CCR_ADMODE_QUAD_24   | QSPI_CCR_IMODE_QUAD   | 0xed)
#define STM32WB_BOOT_QSPI_CCR_READ_4_4_4_M2D6_DTR  (QSPI_CCR_DDR | QSPI_CCR_FMODE_READ  | QSPI_CCR_DMODE_QUAD   | QSPI_CCR_DCYCLE(6) | QSPI_CCR_ABMODE_QUAD_16 | QSPI_CCR_ADMODE_QUAD_24   | QSPI_CCR_IMODE_QUAD   | 0xed)


#define STM32WB_BOOT_QSPI_OPCODE_WRSR              0x01
#define STM32WB_BOOT_QSPI_OPCODE_RDSR              0x05
#define STM32WB_BOOT_QSPI_OPCODE_WREN              0x06
#define STM32WB_BOOT_QSPI_OPCODE_WRDI              0x04
#define STM32WB_BOOT_QSPI_OPCODE_RDID              0x9f
#define STM32WB_BOOT_QSPI_OPCODE_RDSFDP            0x5a
#define STM32WB_BOOT_QSPI_OPCODE_RSTEN             0x66
#define STM32WB_BOOT_QSPI_OPCODE_RST               0x99
#define STM32WB_BOOT_QSPI_OPCODE_DPD               0xb9
#define STM32WB_BOOT_QSPI_OPCODE_RDPD              0xab

