GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
#define STM32WB_BOOT_QSPI_SR_WIP                   0x01
#define STM32WB_BOOT_QSPI_SR_WEL                   0x02

typedef struct _stm32wb_boot_sflash_device_t {
    stm32wb_boot_sflash_info_t     info;
    uint32_t                       ccr_erase;
    uint32_t                       ccr_program;
    uint32_t                       ccr_read;
} stm32wb_boot_sflash_device_t;

static stm32wb_boot_sflash_device_t stm32wb_boot_sflash_device =
{
    .info = {
        .did = { 0, 0, 0 },
        .features = 0,
        .capacity = 0,
        .erase_size = 65536,
        .page_size = 256,
    },
    .ccr_erase = STM32WB_BOOT_QSPI_CCR_ERASE_64K,
    .ccr_program = STM32WB_BOOT_QSPI_CCR_PROGRAM_1_1_1,
    .ccr_read = STM32WB_BOOT_QSPI_CCR_READ_1_1_2_D8,
};

static inline __attribute__((optimize("O3"),always_inline)) uint8_t STM32WB_BOOT_QSPI_READ_8(QUADSPI_TypeDef *QSPI)
{
    volatile uint8_t *fifo = (volatile uint8_t*)((uint32_t)&QSPI->DR);

    return *fifo;
}

static inline __attribute__((optimize("O3"),always_inline)) uint16_t STM32WB_BOOT_QSPI_READ_16(QUADSPI_TypeDef *QSPI)
{
    volatile uint16_t *fifo = (volatile uint16_t*)((uint32_t)&QSPI->DR);

    return *fifo;
}

static inline __attribute__((optimize("O3"),always_inline)) uint32_t STM32WB_BOOT_QSPI_READ_32(QUADSPI_TypeDef *QSPI)
{
    volatile uint32_t *fifo = (volatile uint32_t*)((uint32_t)&QSPI->DR);

    return *fifo;
}

static inline __attribute__((optimize("O3"),always_inline)) void STM32WB_BOOT_QSPI_WRITE_8(QUADSPI_TypeDef *QSPI, const uint8_t data)
{
    volatile uint8_t *fifo = (volatile uint8_t*)((uint32_t)&QSPI->DR);

    *fifo = data;
}

static inline __attribute__((optimize("O3"),always_inline)) void STM32WB_BOOT_QSPI_WRITE_16(QUADSPI_TypeDef *QSPI, const uint16_t data)
{
    volatile uint16_t *fifo = (volatile uint16_t*)((uint32_t)&QSPI->DR);

    *fifo = data;
}

static inline __attribute__((optimize("O3"),always_inline)) void STM32WB_BOOT_QSPI_WRITE_32(QUADSPI_TypeDef *QSPI, const uint32_t data)
{
    volatile uint32_t *fifo = (volatile uint32_t*)((uint32_t)&QSPI->DR);

    *fifo = data;
}

static void __attribute__((noinline)) stm32wb_boot_qspi_command(uint32_t ccr, uint32_t address)
{
    QUADSPI_TypeDef *QSPI = QUADSPI;

    while (QSPI->SR & QUADSPI_SR_BUSY)
    {
    }

    QSPI->CCR = ccr;

    if (ccr & QUADSPI_CCR_ADMODE)
    {
        QSPI->AR  = address;    
    }
}

static uint8_t __attribute__((noinline)) stm32wb_boot_qspi_command_status(uint32_t ccr, uint32_t address)
{
    QUADSPI_TypeDef *QSPI = QUADSPI;
    uint8_t status;
  
    while (QSPI->SR & QUADSPI_SR_BUSY)
    {
    }

    QSPI->DLR = 1 -1;
    QSPI->CCR = ccr;

    if (ccr & QUADSPI_CCR_ADMODE)
    {
        QSPI->AR  = address;    
    }

    while (!(QSPI->SR & QUADSPI_SR_TCF))
    {
    }

    status = STM32WB_BOOT_QSPI_READ_8(QSPI);

    QSPI->FCR = QUADSPI_FCR_CTCF;

    return status;
}

static void __attribute__((noinline)) stm32wb_boot_qspi_command_program(uint32_t ccr, uint32_t address, const uint8_t *data, uint32_t count)
{
    QUADSPI_TypeDef *QSPI = QUADSPI;
    uint32_t data_out;
    const uint32_t *data32, *data32_e;
    const uint16_t *data16;
    const uint8_t *data8;

    while (QSPI->SR & QUADSPI_SR_BUSY)
    {
    }
    
    QSPI->DLR = count -1;
    QSPI->CCR = ccr;

    if (ccr & QUADSPI_CCR_ADMODE)
    {
        QSPI->AR  = address;    
    }

    data32 = (const uint32_t*)(data);

    if (count & ~3)
    {
        data32_e = (const uint32_t*)(data + (count & ~3));

        do
        {
            while (!(QSPI->SR & QUADSPI_SR_FTF))
            {
            }
            
            __asm__ volatile("": : : "memory");
            
            data_out = data32[0];
            
            data32 += 1;
            
            __asm__ volatile("": : : "memory");
            
            STM32WB_BOOT_QSPI_WRITE_32(QSPI, data_out);

            __asm__ volatile("": : : "memory");
        }
        while (data32 != data32_e);
    }

    if (count & 3)
    {
        while (!(QSPI->SR & QUADSPI_SR_FTF))
        {
        }

        data16 = (const uint16_t*)data32;
        
        if (count & 2)
        {
            __asm__ volatile("": : : "memory");
            
            data_out = data16[0];
            
            data16 += 1;

            __asm__ volatile("": : : "memory");
            
            STM32WB_BOOT_QSPI_WRITE_16(QSPI, data_out);
            
            __asm__ volatile("": : : "memory");
        }

        data8 = (const uint8_t*)data16;
        
        if (count & 1)
        {
            __asm__ volatile("": : : "memory");
            
            data_out = data8[0];
            
            data8 += 1;
            
            __asm__ volatile("": : : "memory");
            
            STM32WB_BOOT_QSPI_WRITE_8(QSPI, data_out);
            
            __asm__ volatile("": : : "memory");
        }
    }
    
    QSPI->FCR = QUADSPI_FCR_CTCF;
}

static void __attribute__((noinline)) stm32wb_boot_qspi_command_read(uint32_t ccr, uint32_t address, uint8_t *data, uint32_t count)
{
    QUADSPI_TypeDef *QSPI = QUADSPI;
    uint32_t data_in;
    uint32_t *data32, *data32_e;
    uint16_t *data16;
    uint8_t *data8;

    while (QSPI->SR & QUADSPI_SR_BUSY)
    {
    }
    
    QSPI->DLR = count -1;
    QSPI->CCR = ccr;

    if (ccr & QUADSPI_CCR_ADMODE)
    {
        QSPI->AR  = address;    
    }

    data32 = (uint32_t*)(data);

    if (count & ~3)
    {
        data32_e = (uint32_t*)(data + (count & ~3));
        
        do
        {
            while (!(QSPI->SR & QUADSPI_SR_FTF))
            {
            }

            __asm__ volatile("": : : "memory");
            
            data_in = STM32WB_BOOT_QSPI_READ_32(QSPI);
            
            __asm__ volatile("": : : "memory");
            
            data32[0] = data_in;
            
            data32 += 1;

            __asm__ volatile("": : : "memory");
        }
        while (data32 != data32_e);
    }

    if (count & 3)
    {
        while (!(QSPI->SR & QUADSPI_SR_TCF))
        {
        }

        data16 = (uint16_t*)data32;
        
        if (count & 2)
        {
            __asm__ volatile("": : : "memory");
            
