GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
            data_in = STM32WB_BOOT_QSPI_READ_16(QSPI);
            
            __asm__ volatile("": : : "memory");
            
            data16[0] = data_in;
            
            data16 += 1;

            __asm__ volatile("": : : "memory");
        }

        data8 = (uint8_t*)data16;
        
        if (count & 1)
        {
            __asm__ volatile("": : : "memory");
            
            data_in = STM32WB_BOOT_QSPI_READ_8(QSPI);
            
            __asm__ volatile("": : : "memory");
            
            data8[0] = data_in;
            
            data8 += 1;

            __asm__ volatile("": : : "memory");
        }
    }

    QSPI->FCR = QUADSPI_FCR_CTCF;
}

static bool __attribute__((noinline)) stm32wb_boot_qspi_command_verify(uint32_t ccr, uint32_t address, const uint8_t *data, uint32_t count)
{
    QUADSPI_TypeDef *QSPI = QUADSPI;
    uint32_t data_in, data_verify;
    uint32_t *data32, *data32_e;
    uint16_t *data16;
    uint8_t *data8;

    while (QSPI->SR & QUADSPI_SR_BUSY)
    {
    }
    
    QSPI->DLR = count -1;
    QSPI->CCR = ccr;

    if (ccr & QUADSPI_CCR_ADMODE)
    {
        QSPI->AR  = address;    
    }

    data_verify = 0;
    
    data32 = (uint32_t*)(data);

    if (count & ~3)
    {
        data32_e = (uint32_t*)(data + (count & ~3));
        
        do
        {
            while (!(QSPI->SR & QUADSPI_SR_FTF))
            {
            }

            __asm__ volatile("": : : "memory");
            
            data_in = STM32WB_BOOT_QSPI_READ_32(QSPI);
            
            __asm__ volatile("": : : "memory");
            
            data_verify |= (data32[0] ^ data_in);
            
            data32 += 1;

            __asm__ volatile("": : : "memory");
        }
        while (data32 != data32_e);
    }

    if (count & 3)
    {
        while (!(QSPI->SR & QUADSPI_SR_TCF))
        {
        }

        data16 = (uint16_t*)data32;
        
        if (count & 2)
        {
            __asm__ volatile("": : : "memory");
            
            data_in = STM32WB_BOOT_QSPI_READ_16(QSPI);
            
            __asm__ volatile("": : : "memory");
            
            data_verify |= (data16[0] ^ data_in);
            
            data16 += 1;

            __asm__ volatile("": : : "memory");
        }

        data8 = (uint8_t*)data16;
        
        if (count & 1)
        {
            __asm__ volatile("": : : "memory");
            
            data_in = STM32WB_BOOT_QSPI_READ_8(QSPI);
            
            __asm__ volatile("": : : "memory");
            
            data_verify |= (data8[0] ^ data_in);
            
            data8 += 1;

            __asm__ volatile("": : : "memory");
        }
    }

    QSPI->FCR = QUADSPI_FCR_CTCF;

    return (data_verify == 0);
}

static void stm32wb_boot_sflash_wait()
{
    uint8_t sr;
    
    do
    {
        sr = stm32wb_boot_qspi_command_status((STM32WB_BOOT_QSPI_CCR_COMMAND_STATUS | STM32WB_BOOT_QSPI_OPCODE_RDSR), 0);
    }
    while (sr & STM32WB_BOOT_QSPI_SR_WIP);
}

static stm32wb_boot_sflash_info_t * __attribute__((noinline)) stm32wb_boot_sflash_init(void)
{
    QUADSPI_TypeDef *QSPI = QUADSPI;
    uint8_t did[3], sr, sr1, sr2, cr[2];
    bool busy;
    uint32_t features;
    
    if (!stm32wb_boot_sflash_device.info.did[0])
    {
        if (stm32wb_boot_info.options & STM32WB_SYSTEM_OPTION_SFLASH_BOOST)
        {
            stm32wb_boot_gpio_pin_write(stm32wb_boot_info.pins.boost, 1);

            armv7m_core_udelay(400);
        }
        
        stm32wb_boot_gpio_pin_configure(stm32wb_boot_info.pins.sflash_cs,   (STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));
        stm32wb_boot_gpio_pin_configure(stm32wb_boot_info.pins.sflash_clk,  (STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));
        stm32wb_boot_gpio_pin_configure(stm32wb_boot_info.pins.sflash_mosi, (STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));
        stm32wb_boot_gpio_pin_configure(stm32wb_boot_info.pins.sflash_miso, (STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));

        if ((stm32wb_boot_info.pins.sflash_wp != STM32WB_GPIO_PIN_NONE) && (stm32wb_boot_info.pins.sflash_hold != STM32WB_GPIO_PIN_NONE))
        {
            stm32wb_boot_gpio_pin_configure(stm32wb_boot_info.pins.sflash_wp,   (STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));
            stm32wb_boot_gpio_pin_configure(stm32wb_boot_info.pins.sflash_hold, (STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));

            features = STM32WB_BOOT_SFLASH_FEATURE_QUAD;

            stm32wb_boot_sflash_device.ccr_read = STM32WB_BOOT_QSPI_CCR_READ_1_1_4_D8;
        }
        else
        {
            features = 0;
        }

        /* Max QUADSPI clk is 60MHz for SDR and 48MHz for DDR, we are running at 64MHz, so prescaling is needed.
         */
    
        RCC->AHB3ENR |= RCC_AHB3ENR_QUADSPIEN;
        RCC->AHB3ENR;
    
        QSPI->DCR = QUADSPI_DCR_FSIZE | ((2 -1) << QUADSPI_DCR_CSHT_Pos);
        QSPI->ABR = 0xfffffff;
        QSPI->CR = ((2-1) << QUADSPI_CR_PRESCALER_Pos) | ((8-1) << QUADSPI_CR_FTHRES_Pos) | QUADSPI_CR_EN;
        
        if (stm32wb_boot_info.pins.sflash_enable != STM32WB_GPIO_PIN_NONE)
        {
            stm32wb_boot_gpio_pin_configure(stm32wb_boot_info.pins.sflash_enable, (STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_ODATA_1 | STM32WB_GPIO_OSPEED_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_OUTPUT));

            armv7m_core_udelay(3000);
        }
        
        /* A tad messy. First a possible QPI mode needs to be exited. And the of course
         * before that Deep Power Down needs to be released before that (QPI) and then
         * afterwards (non-QPI).
         */
        stm32wb_boot_qspi_command((STM32WB_BOOT_QSPI_CCR_COMMAND_QPI | STM32WB_BOOT_QSPI_OPCODE_RDPD), 0);

