GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
        armv7m_core_udelay(250);

        stm32wb_boot_qspi_command((STM32WB_BOOT_QSPI_CCR_COMMAND_QPI | STM32WB_BOOT_QSPI_OPCODE_RSTEN), 0);
        stm32wb_boot_qspi_command((STM32WB_BOOT_QSPI_CCR_COMMAND_QPI | STM32WB_BOOT_QSPI_OPCODE_RST), 0);

        armv7m_core_udelay(100);
        
        stm32wb_boot_qspi_command((STM32WB_BOOT_QSPI_CCR_COMMAND | STM32WB_BOOT_QSPI_OPCODE_RDPD), 0);
    
        armv7m_core_udelay(250);

        stm32wb_boot_qspi_command_read(STM32WB_BOOT_QSPI_CCR_RDID, 0, &did[0], 3);

        if (did[0] == 0x00)
        {
            return NULL;
        }

        /* Configure MX25Rxx35 for "High Performance Mode" ...
         */
        if ((did[0] == STM32WB_BOOT_QSPI_MID_MACRONIX) && (did[1] == 0x28))
        {
            stm32wb_boot_qspi_command_read((STM32WB_BOOT_QSPI_CCR_COMMAND_READ | 0x15), 0, &cr[0], 2);
            
            if (!(cr[1] & 0x02))
            {
                sr = stm32wb_boot_qspi_command_status((STM32WB_BOOT_QSPI_CCR_COMMAND_STATUS | STM32WB_BOOT_QSPI_OPCODE_RDSR), 0);

                stm32wb_boot_qspi_command((STM32WB_BOOT_QSPI_CCR_COMMAND | STM32WB_BOOT_QSPI_OPCODE_WREN), 0);
                stm32wb_boot_qspi_command((STM32WB_BOOT_QSPI_CCR_COMMAND_WRITE_3 | STM32WB_BOOT_QSPI_OPCODE_WRSR), ((sr << 16) | (cr[0] << 8) | (cr[1] | 0x02)));
		
                stm32wb_boot_sflash_wait();
	    }
        }

        if (features & STM32WB_BOOT_SFLASH_FEATURE_QUAD)
        {
            busy = false;
            
            if (did[0] == STM32WB_BOOT_QSPI_MID_MACRONIX)
            {
                sr1 = stm32wb_boot_qspi_command_status((STM32WB_BOOT_QSPI_CCR_COMMAND_STATUS | STM32WB_BOOT_QSPI_OPCODE_RDSR), 0);
                
                if (!(sr1 & 0x40))
                {
                    stm32wb_boot_qspi_command((STM32WB_BOOT_QSPI_CCR_COMMAND | STM32WB_BOOT_QSPI_OPCODE_WREN), 0);
                    stm32wb_boot_qspi_command((STM32WB_BOOT_QSPI_CCR_COMMAND_WRITE_1 | STM32WB_BOOT_QSPI_OPCODE_WRSR), (sr1 | 0x40));
                    
                    busy = true;
                }
            }
            else
            {
                sr1 = stm32wb_boot_qspi_command_status((STM32WB_BOOT_QSPI_CCR_COMMAND_STATUS | STM32WB_BOOT_QSPI_OPCODE_RDSR), 0);
                sr2 = stm32wb_boot_qspi_command_status((STM32WB_BOOT_QSPI_CCR_COMMAND_STATUS | 0x35), 0);
                    
                if (!(sr2 & 0x02))
                {
                    stm32wb_boot_qspi_command((STM32WB_BOOT_QSPI_CCR_COMMAND | STM32WB_BOOT_QSPI_OPCODE_WREN), 0);
                    stm32wb_boot_qspi_command((STM32WB_BOOT_QSPI_CCR_COMMAND_WRITE_2 | STM32WB_BOOT_QSPI_OPCODE_WRSR), ((sr1 << 8) | (sr2 | 0x02)));
                        
                    busy = true;
                }
            }

            if (busy)
            {
                do
                {
                    sr = stm32wb_boot_qspi_command_status((STM32WB_BOOT_QSPI_CCR_COMMAND_STATUS | STM32WB_BOOT_QSPI_OPCODE_RDSR), 0);
                }
                while (sr & STM32WB_BOOT_QSPI_SR_WIP);
            }

            stm32wb_boot_sflash_device.info.capacity = 1 << (did[2] & 0x1f);
        
            if (stm32wb_boot_sflash_device.info.capacity > 0x01000000)
            {
                stm32wb_boot_qspi_command((STM32WB_BOOT_QSPI_CCR_COMMAND | 0xe9), 0x00);
                stm32wb_boot_qspi_command((STM32WB_BOOT_QSPI_CCR_COMMAND_WRITE_1 | 0xc5), 0x00);
            }
        }
        
        stm32wb_boot_sflash_device.info.did[0] = did[0];
        stm32wb_boot_sflash_device.info.did[1] = did[1];
        stm32wb_boot_sflash_device.info.did[2] = did[2];
        stm32wb_boot_sflash_device.info.features = features;
    }

    return &stm32wb_boot_sflash_device.info;
}

static bool stm32wb_boot_sflash_erase(uint32_t address)
{
    stm32wb_boot_qspi_command((STM32WB_BOOT_QSPI_CCR_COMMAND | STM32WB_BOOT_QSPI_OPCODE_WREN), 0);
    
    stm32wb_boot_qspi_command(stm32wb_boot_sflash_device.ccr_erase, address);

    stm32wb_boot_sflash_wait();
    
    return true;
}

static void stm32wb_boot_sflash_program(uint32_t address, const uint8_t *data, uint32_t count)
{
    stm32wb_boot_qspi_command((STM32WB_BOOT_QSPI_CCR_COMMAND | STM32WB_BOOT_QSPI_OPCODE_WREN), 0);
    
    stm32wb_boot_qspi_command_program(stm32wb_boot_sflash_device.ccr_program, address, data, count);

    stm32wb_boot_sflash_wait();
}

static void stm32wb_boot_sflash_read(uint32_t address, uint8_t *data, uint32_t count)
{
    stm32wb_boot_qspi_command_read(stm32wb_boot_sflash_device.ccr_read, address, data, count);
}

static bool stm32wb_boot_sflash_verify(uint32_t address, const uint8_t *data, uint32_t count)
{
    return stm32wb_boot_qspi_command_verify(stm32wb_boot_sflash_device.ccr_read, address, data, count);
}

#endif /* (STM32WB_BOOT_FWU_CONFIG_SFLASH == 1) */

/************************************************************************************************************************************/

#if (STM32WB_BOOT_FWU_CONFIG_SFLASH == 1)

typedef struct _stm32wb_boot_nvm_control_t {
    stm32wb_boot_aes128_context_t  aes128_ctx;
    uint32_t                       aes128_iv[4];
} stm32wb_boot_nvm_control_t;

static stm32wb_boot_nvm_control_t stm32wb_boot_nvm_control;

static void __attribute__((noinline)) stm32wb_boot_nvm_set_key(const uint32_t *key)
{
    stm32wb_boot_aes128_set_key(&stm32wb_boot_nvm_control.aes128_ctx, key);

    stm32wb_boot_nvm_control.aes128_iv[0] = 0;
    stm32wb_boot_nvm_control.aes128_iv[1] = 0;
    stm32wb_boot_nvm_control.aes128_iv[2] = 0;
    stm32wb_boot_nvm_control.aes128_iv[3] = 0;
    
}

static bool __attribute__((noinline)) stm32wb_boot_nvm_erase(uint32_t address)
{
    if (address < STM32WB_BOOT_SFLASH_LIMIT)
    {
        return stm32wb_boot_sflash_erase(address);
    }

    return stm32wb_boot_flash_erase(address);
}

static bool __attribute__((noinline)) stm32wb_boot_nvm_program(uint32_t address, const uint8_t *data, uint32_t count, bool encrypted)
{
    uint32_t program_data[STM32WB_BOOT_NVM_PROGRAM_SIZE / 4];

