GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
    if (address < STM32WB_BOOT_SFLASH_LIMIT)
    {
        if (encrypted)
        {
            stm32wb_boot_nvm_control.aes128_iv[3] = SWAP(address / 16);
            
            stm32wb_boot_aes128_ctr_encrypt(&stm32wb_boot_nvm_control.aes128_ctx, &stm32wb_boot_nvm_control.aes128_iv[0], (const uint32_t*)data, (uint32_t*)&program_data[0], count);
            
            data = (const uint8_t*)&program_data[0];
        }
        
        stm32wb_boot_sflash_program(address, data, count);

        return stm32wb_boot_sflash_verify(address, data, count);
    }

    return stm32wb_boot_flash_program(address, data, count);
}

static void __attribute__((noinline)) stm32wb_boot_nvm_read(uint32_t address, uint8_t *data, uint32_t count, bool encrypted)
{
    if (address < STM32WB_BOOT_SFLASH_LIMIT)
    {
        stm32wb_boot_sflash_read(address, data, count);

        if (encrypted)
        {
            stm32wb_boot_nvm_control.aes128_iv[3] = SWAP(address / 16);
            
            stm32wb_boot_aes128_ctr_encrypt(&stm32wb_boot_nvm_control.aes128_ctx, &stm32wb_boot_nvm_control.aes128_iv[0], (const uint32_t*)data, (uint32_t*)data, count);
        }
        
        return;
    }

    stm32wb_boot_memcpy(data, (const uint8_t*)address, count);
}

#else /* (STM32WB_BOOT_FWU_CONFIG_SFLASH == 1) */

static bool stm32wb_boot_nvm_erase(uint32_t address)
{
    return stm32wb_boot_flash_erase(address);
}

static bool stm32wb_boot_nvm_program(uint32_t address, const uint8_t *data, uint32_t count, bool encrypted)
{
    return stm32wb_boot_flash_program(address, data, count);
}

static void stm32wb_boot_nvm_read(uint32_t address, uint8_t *data, uint32_t count, bool encrypted)
{
    stm32wb_boot_memcpy(data, (const uint8_t*)address, count);
}

#endif /* (STM32WB_BOOT_FWU_CONFIG_SFLASH == 1) */

/************************************************************************************************************************************/

static void __attribute__((noinline)) stm32wb_boot_random(uint8_t *data, uint32_t count)
{
    uint32_t random[4];
    uint32_t sr;
    uint8_t *data_e;
    
    RCC->AHB3ENR |= RCC_AHB3ENR_RNGEN;
    RCC->AHB3ENR;

    RNG->CR |= RNG_CR_RNGEN;

    data_e = data + count;

    while (data < data_e)
    {
        do
        {
            sr = RNG->SR;
        }
        while (!(sr & (RNG_SR_SECS | RNG_SR_DRDY)));

        random[0] = RNG->DR;
        random[1] = RNG->DR;
        random[2] = RNG->DR;
        random[3] = RNG->DR;

        if (!(sr & RNG_SR_SECS))
        {
            count = sizeof(random);
            
            if (count > (uint32_t)(data_e - data))
            {
                count = (uint32_t)(data_e - data);
            }
            
            stm32wb_boot_memcpy(data, (const uint8_t*)&random[0], count);
            
            data += count;
        }
    }
    
    RNG->CR &= ~RNG_CR_RNGEN;
    
    RCC->AHB3ENR &= ~RCC_AHB3ENR_RNGEN;
}

/************************************************************************************************************************************/

static uint32_t __attribute__((noinline)) stm32wb_boot_crc32(const uint8_t *data, uint32_t size, uint32_t crc32)
{
    const uint32_t *in, *in_e;
    
    if (size)
    {
        RCC->AHB1ENR |= RCC_AHB1ENR_CRCEN;

        in = (const uint32_t*)data;
        in_e = (const uint32_t*)(data + size);

        CRC->INIT = __RBIT(crc32);
        CRC->POL  = 0x04c11db7;
        CRC->CR   = CRC_CR_RESET | CRC_CR_REV_IN_0 | CRC_CR_REV_IN_1 | CRC_CR_REV_OUT;

        do
        {
            CRC->DR = *in++;
        }
        while (in != in_e);

        crc32 = CRC->DR;
        
        RCC->AHB1ENR &= ~RCC_AHB1ENR_CRCEN;
    }

    return crc32;
}

/************************************************************************************************************************************/

static void  __attribute__((noinline)) stm32wb_boot_aes128_get_key(const uint32_t *nonce, uint32_t *key)
{
    stm32wb_boot_aes128_context_t aes128_ctx;
    uint32_t aes128_key[4];
    stm32wb_boot_sha256_context_t sha256_ctx;
    uint32_t sha256_hash[STM32WB_BOOT_SHA256_HASH_SIZE / 4];
    uint32_t idcode;
    
    ((stm32wb_boot_aes128_get_key_routine_t)(STM32WB_BOOT_AES128_KEY | 1))(&aes128_key[0]);

    stm32wb_boot_aes128_set_key(&aes128_ctx, &aes128_key[0]);
    
    idcode = STM32WB_FWU_IDCODE_STM32WB55;
            
    stm32wb_boot_sha256_init(&sha256_ctx);
    stm32wb_boot_sha256_update(&sha256_ctx, (const uint8_t*)&stm32wb_boot_info.uuid[0], 16);
    stm32wb_boot_sha256_update(&sha256_ctx, (const uint8_t*)&idcode, 4);
    stm32wb_boot_sha256_update(&sha256_ctx, (const uint8_t*)&nonce[0], 12);
    stm32wb_boot_sha256_final(&sha256_ctx, sha256_hash);
    
    stm32wb_boot_aes128_ecb_encrypt(&aes128_ctx, &sha256_hash[0], &key[0], 16);
}

static void __attribute__((noinline)) stm32wb_boot_aes128_set_key(stm32wb_boot_aes128_context_t *aes128_ctx, const uint32_t *key)
{
    aes128_ctx->K[0] = SWAP(key[3]);
    aes128_ctx->K[1] = SWAP(key[2]);
    aes128_ctx->K[2] = SWAP(key[1]);
    aes128_ctx->K[3] = SWAP(key[0]);
}

static void __attribute__((noinline)) stm32wb_boot_aes128_encrypt(stm32wb_boot_aes128_context_t *aes128_ctx, uint32_t mode, const uint32_t *iv, const uint32_t *in, uint32_t *out, uint32_t count)
{
    RCC->AHB2ENR |= RCC_AHB2ENR_AES1EN;
    RCC->AHB2ENR;

    AES1->KEYR0 = aes128_ctx->K[0];
    AES1->KEYR1 = aes128_ctx->K[1];
    AES1->KEYR2 = aes128_ctx->K[2];
    AES1->KEYR3 = aes128_ctx->K[3];
    
    AES1->CR = AES_CR_DATATYPE_1 | mode;

    if (iv)
    {
        AES1->IVR0 = SWAP(iv[3]);
        AES1->IVR1 = SWAP(iv[2]);
        AES1->IVR2 = SWAP(iv[1]);
        AES1->IVR3 = SWAP(iv[0]);
    }

    AES1->CR = AES_CR_EN | AES_CR_DATATYPE_1 | mode;

    for (; count >= 16; count -= 16, in += 4, out += 4)
    {
        AES1->DINR = in[0];
        AES1->DINR = in[1];
        AES1->DINR = in[2];
        AES1->DINR = in[3];
        
        while (!(AES1->SR & AES_SR_CCF))
        {
        }
        
        AES1->CR |= AES_CR_CCFC;
        
        out[0] = AES1->DOUTR;
        out[1] = AES1->DOUTR;
        out[2] = AES1->DOUTR;
        out[3] = AES1->DOUTR;
    }
    
