GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
    stm32wb_boot_memcpy(&sha256_ctx->hash[0], &stm32wb_boot_sha256_const_H[0], 32);
}

static void __attribute__((noinline)) stm32wb_boot_sha256_update(stm32wb_boot_sha256_context_t *sha256_ctx, const uint8_t *data, size_t size)
{
    uint32_t index, count;
  
    sha256_ctx->length += size;

    index = sha256_ctx->index;
    
    while (size)
    {
        if ((index == 0) && !((uint32_t)data & 3) && (size & ~63))
        {
            count = size & ~63;

            stm32wb_boot_sha256_compress(&sha256_ctx->hash[0], (const uint32_t*)data, (const uint32_t*)(data + count));

            data += count;
            size -= count;
        }
        else
        {
            sha256_ctx->data[index++] = *data++;
            
            size--;
            
            if (index == 64)
            {
                stm32wb_boot_sha256_compress(&sha256_ctx->hash[0], (const uint32_t*)&sha256_ctx->data[0], (const uint32_t*)&sha256_ctx->data[64]);
                
                index = 0;
            }
        }
    }
    
    sha256_ctx->index = index;
}

static void __attribute__((noinline)) stm32wb_boot_sha256_final(stm32wb_boot_sha256_context_t *sha256_ctx, uint32_t *hash)
{
    sha256_ctx->data[sha256_ctx->index++] = 0x80;

    if (sha256_ctx->index > (64-8))
    {
        stm32wb_boot_memset(&sha256_ctx->data[sha256_ctx->index], 0x00, 64 - sha256_ctx->index);
        
        stm32wb_boot_sha256_compress(&sha256_ctx->hash[0], (const uint32_t*)&sha256_ctx->data[0], (const uint32_t*)&sha256_ctx->data[64]);

        sha256_ctx->index = 0;
    }

    if (sha256_ctx->index != (64-8+3))
    {
        stm32wb_boot_memset(&sha256_ctx->data[sha256_ctx->index], 0x00, (64-8+3) - sha256_ctx->index);
    }

    sha256_ctx->data[59] = sha256_ctx->length >> (32-3);
    sha256_ctx->data[60] = sha256_ctx->length >> (24-3);
    sha256_ctx->data[61] = sha256_ctx->length >> (16-3);
    sha256_ctx->data[62] = sha256_ctx->length >>  (8-3);
    sha256_ctx->data[63] = sha256_ctx->length <<    (3);

    stm32wb_boot_sha256_compress(&sha256_ctx->hash[0], (const uint32_t*)&sha256_ctx->data[0], (const uint32_t*)&sha256_ctx->data[64]);

    hash[0] = SWAP(sha256_ctx->hash[0]);
    hash[1] = SWAP(sha256_ctx->hash[1]);
    hash[2] = SWAP(sha256_ctx->hash[2]);
    hash[3] = SWAP(sha256_ctx->hash[3]);
    hash[4] = SWAP(sha256_ctx->hash[4]);
    hash[5] = SWAP(sha256_ctx->hash[5]);
    hash[6] = SWAP(sha256_ctx->hash[6]);
    hash[7] = SWAP(sha256_ctx->hash[7]);    
}

/************************************************************************************************************************************/

#define STM32WB_BOOT_ECC256_NUM_BITS   256
#define STM32WB_BOOT_ECC256_NUM_BYTES  32
#define STM32WB_BOOT_ECC256_NUM_WORDS  8

static const uint32_t stm32wb_boot_ecc256_in_coeff_a_sign = 1;

static const uint32_t stm32wb_boot_ecc256_in_coeff_a[] = {
    0x00000003, 0x00000000, 0x00000000, 0x00000000,
    0x00000000, 0x00000000, 0x00000000, 0x00000000,
};

static const uint32_t stm32wb_boot_ecc256_in_mod_gf[] = {
    0xffffffff, 0xffffffff, 0xffffffff, 0x00000000,
    0x00000000, 0x00000000, 0x00000001, 0xffffffff,
};

static const uint32_t stm32wb_boot_ecc256_in_initial_point_x[] = {
    0xd898c296, 0xf4a13945, 0x2deb33a0, 0x77037d81,
    0x63a440f2, 0xf8bce6e5, 0xe12c4247, 0x6b17d1f2,
};

static const uint32_t stm32wb_boot_ecc256_in_initial_point_y[] = {
    0x37bf51f5, 0xcbb64068, 0x6b315ece, 0x2bce3357,
    0x7c0f9e16, 0x8ee7eb4a, 0xfe1a7f9b, 0x4fe342e2,
};

static const uint32_t stm32wb_boot_ecc256_in_order_n[] = {
    0xfc632551, 0xf3b9cac2, 0xa7179e84, 0xbce6faad,
    0xffffffff, 0xffffffff, 0x00000000, 0xffffffff,
};

static void __attribute__((noinline)) stm32wb_boot_ecc256_param(uint32_t offset, const uint32_t *param, uint32_t count)
{
    uint32_t index;

    for (index = 0; index < count; index++)
    {
        PKA->RAM[offset + index] = param[index];
    }
    PKA->RAM[offset + count] = 0;
}

static bool __attribute__((noinline)) stm32wb_boot_ecc256_verify(const stm32wb_boot_ecc256_key_t *key, const uint32_t *signature, const uint32_t *digest)
{
    uint32_t index;
    bool success;

    RCC->AHB3ENR |= RCC_AHB3ENR_PKAEN;
    RCC->AHB3ENR;

    PKA->CR = PKA_CR_EN;

    PKA->CLRFR = ~0ul;

    PKA->RAM[PKA_ECDSA_VERIF_IN_ORDER_NB_BITS] = STM32WB_BOOT_ECC256_NUM_BITS;
    PKA->RAM[PKA_ECDSA_VERIF_IN_MOD_NB_BITS] = STM32WB_BOOT_ECC256_NUM_BITS;
    PKA->RAM[PKA_ECDSA_VERIF_IN_A_COEFF_SIGN] = stm32wb_boot_ecc256_in_coeff_a_sign;

    stm32wb_boot_ecc256_param(PKA_ECDSA_VERIF_IN_A_COEFF, stm32wb_boot_ecc256_in_coeff_a, STM32WB_BOOT_ECC256_NUM_WORDS);
    stm32wb_boot_ecc256_param(PKA_ECDSA_VERIF_IN_MOD_GF, stm32wb_boot_ecc256_in_mod_gf, STM32WB_BOOT_ECC256_NUM_WORDS);
    stm32wb_boot_ecc256_param(PKA_ECDSA_VERIF_IN_INITIAL_POINT_X, stm32wb_boot_ecc256_in_initial_point_x, STM32WB_BOOT_ECC256_NUM_WORDS);
    stm32wb_boot_ecc256_param(PKA_ECDSA_VERIF_IN_INITIAL_POINT_Y, stm32wb_boot_ecc256_in_initial_point_y, STM32WB_BOOT_ECC256_NUM_WORDS);
    stm32wb_boot_ecc256_param(PKA_ECDSA_VERIF_IN_PUBLIC_KEY_POINT_X, key->x, STM32WB_BOOT_ECC256_NUM_WORDS);
    stm32wb_boot_ecc256_param(PKA_ECDSA_VERIF_IN_PUBLIC_KEY_POINT_Y, key->y, STM32WB_BOOT_ECC256_NUM_WORDS);
    stm32wb_boot_ecc256_param(PKA_ECDSA_VERIF_IN_SIGNATURE_R, ((const uint32_t*)&signature[0]), STM32WB_BOOT_ECC256_NUM_WORDS);
    stm32wb_boot_ecc256_param(PKA_ECDSA_VERIF_IN_SIGNATURE_S, ((const uint32_t*)&signature[8]), STM32WB_BOOT_ECC256_NUM_WORDS);
    stm32wb_boot_ecc256_param(PKA_ECDSA_VERIF_IN_ORDER_N, stm32wb_boot_ecc256_in_order_n, STM32WB_BOOT_ECC256_NUM_WORDS);
    
    for (index = 0; index < STM32WB_BOOT_SHA256_NUM_WORDS; index++)
    {
        PKA->RAM[PKA_ECDSA_VERIF_IN_HASH_E + index] = SWAP(((const uint32_t*)&digest[0])[(STM32WB_BOOT_SHA256_NUM_WORDS-1) - index]);
    }
    PKA->RAM[PKA_ECDSA_VERIF_IN_HASH_E + STM32WB_BOOT_SHA256_NUM_WORDS] = 0;

    PKA->CR = (PKA->CR & ~PKA_CR_MODE) | (0x26 << PKA_CR_MODE_Pos);
    
    PKA->CR |= PKA_CR_START;

    while (!(PKA->SR & PKA_SR_PROCENDF)) { }

    PKA->CLRFR = ~0ul;

