GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
    success = (PKA->RAM[PKA_ECDSA_VERIF_OUT_RESULT] == 0);

    PKA->CR = 0;
    
    RCC->AHB3ENR &= ~RCC_AHB3ENR_PKAEN;

    return success;
}

/************************************************************************************************************************************/

static const stm32wb_application_info_t * __attribute__((noinline)) stm32wb_boot_application_info(void)
{
    const stm32wb_application_vectors_t *application_vectors;
    const stm32wb_application_info_t *application_info;
    uint32_t application_base, application_size, signature_size;
    stm32wb_boot_sha256_context_t sha256_ctx;
    uint32_t sha256_hash[STM32WB_BOOT_SHA256_HASH_SIZE / 4];
    uint32_t crc32;
    
    application_base = stm32wb_boot_info.application_base;

    application_vectors = (const stm32wb_application_vectors_t*)application_base;

    if (application_vectors->magic != ((((const stm32wb_boot_vectors_t*)stm32wb_boot_vectors)->magic & ~STM32WB_BOOT_TYPE_MASK) | STM32WB_APPLICATION_TYPE_APPLICATION))
    {
        return NULL;
    }

    if (((const stm32wb_application_vectors_t*)stm32wb_boot_vectors)->magic & STM32WB_BOOT_OPTION_SIGNATURE_MASK)
    {
        signature_size = STM32WB_APPLICATION_SIGNATURE_SIZE_ECC256;
    }
    else
    {
        signature_size = STM32WB_APPLICATION_SIGNATURE_SIZE_NONE;
    }
        
    if (application_vectors->base != application_base)
    {
        return NULL;
    }
    
    application_size = application_vectors->size;

    if (((application_size + signature_size) > (stm32wb_boot_info.application_limit - application_base)) || (application_size & 15))
    {
        return NULL;
    }
    
    application_info = (const stm32wb_application_info_t*)(application_base + application_size - sizeof(stm32wb_application_info_t));

    if (stm32wb_boot_memcmp(&stm32wb_boot_info.uuid[0], &application_info->uuid[0], sizeof(stm32wb_boot_info.uuid)))
    {
        return NULL;
    }

    if (signature_size)
    {
        stm32wb_boot_sha256_init(&sha256_ctx);
        stm32wb_boot_sha256_update(&sha256_ctx, (const uint8_t*)application_base, application_size);
        stm32wb_boot_sha256_final(&sha256_ctx, sha256_hash);

        if (!stm32wb_boot_ecc256_verify((const stm32wb_boot_ecc256_key_t *)stm32wb_boot_info.ecc256_key, (const uint32_t*)((const uint8_t*)application_base + application_size), sha256_hash))
        {
            return NULL;
        }
    }
    else
    {
        crc32 = stm32wb_boot_crc32((const uint8_t*)application_base, (application_size - sizeof(uint32_t)), 0xffffffff);

        if (application_info->crc32 != crc32)
        {
            return NULL;
        }
    }
    
    return application_info;
}

void __attribute__((noreturn, noinline)) stm32wb_boot_application(void)
{
    const stm32wb_application_info_t *application_info;
    uint32_t fwu_state;
    uint32_t boot_dfu;

    if (stm32wb_boot_info.pins.status != STM32WB_GPIO_PIN_NONE)
    {
        stm32wb_boot_gpio_pin_configure(stm32wb_boot_info.pins.status, (STM32WB_GPIO_PUPD_PULLUP | STM32WB_GPIO_ODATA_1 |STM32WB_GPIO_OSPEED_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_OUTPUT));
    }

    if (stm32wb_boot_info.pins.boost != STM32WB_GPIO_PIN_NONE)
    {
        stm32wb_boot_gpio_pin_configure(stm32wb_boot_info.pins.boost, (STM32WB_GPIO_PUPD_PULLDOWN | STM32WB_GPIO_ODATA_0 |STM32WB_GPIO_OSPEED_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_OUTPUT));
    }
    
    if (PWR->EXTSCR & PWR_EXTSCR_C1SBF)
    {
        stm32wb_boot_leave(stm32wb_boot_info.application_base);
    }
    
    /* The STM32 BOOTLOADER does not do a reset when jumping to the newly flashed
     * code. Hence CPU2 might be booted. If so, do a software reset.
     */
    if (PWR->CR4 & PWR_CR4_C2BOOT)
    {
        stm32wb_boot_reset();
    }

    RCC->CR &= ~RCC_CR_PLLON;

    RCC->PLLCFGR = ((1 << RCC_PLLCFGR_PLLR_Pos) | (64000000 / (16000000 / 2)) << RCC_PLLCFGR_PLLN_Pos) | (((1-1) << RCC_PLLCFGR_PLLM_Pos) | RCC_PLLCFGR_PLLREN | RCC_PLLCFGR_PLLSRC_HSI);
    
    RCC->CR |= RCC_CR_PLLON;

    while (!(RCC->CR & RCC_CR_PLLRDY))
    {
    }

    RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_PLL;
            
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL)
    {
    }
    
    RCC->CRRCR |= RCC_CRRCR_HSI48ON;

    while(!(RCC->CRRCR & RCC_CRRCR_HSI48RDY))
    {
    }

    SCB->CCR = 0;
    SCB->SHCSR = 0;
    
    NVIC_SetPriority(SVCall_IRQn, ARMV7M_IRQ_PRIORITY_SVCALL);
    NVIC_SetPriority(PendSV_IRQn, ARMV7M_IRQ_PRIORITY_PENDSV);
    
    RCC->APB1ENR1 |= RCC_APB1ENR1_RTCAPBEN;
    
    PWR->CR1 |= PWR_CR1_DBP;
    
    while (!(PWR->CR1 & PWR_CR1_DBP))
    {
    }

    stm32wb_boot_memcpy((uint8_t*)__boot_data_start__, (const uint8_t*)__boot_data_flash__, (uint32_t)__boot_data_end__ - (uint32_t)__boot_data_start__);
    stm32wb_boot_memset((uint8_t*)__boot_bss_start__, 0, (uint32_t)__boot_bss_end__ - (uint32_t)__boot_bss_start__);

    if ((FLASH->OPTR & FLASH_OPTR_RDP) == 0xaa)
    {
        stm32wb_boot_sha256_context_t sha256_ctx;
        uint32_t sha256_hash[STM32WB_BOOT_SHA256_HASH_SIZE / 4];
      
        stm32wb_boot_sha256_init(&sha256_ctx);
        stm32wb_boot_sha256_update(&sha256_ctx, (const uint8_t*)STM32WB_BOOT_BASE, (STM32WB_BOOT_HASH - STM32WB_BOOT_BASE));
        stm32wb_boot_sha256_final(&sha256_ctx, sha256_hash);

        if (stm32wb_boot_memcmp((const uint8_t*)STM32WB_BOOT_HASH, sha256_hash, sizeof(sha256_hash)))
        {
            while (1)
            {
            }
        }

        /* Add PCROP/WPROT, BOOT/PH3 and switch to RDP Level 1 if PROTECTED.
         */
        if (((const stm32wb_application_vectors_t*)stm32wb_boot_vectors)->magic & STM32WB_BOOT_OPTION_PROTECTED)
        {
            FLASH->KEYR      = 0x45670123;
            FLASH->KEYR      = 0xcdef89ab;
            
            FLASH->OPTKEYR   = 0x08192a3b;
            FLASH->OPTKEYR   = 0x4c5d6e7f;

            FLASH->OPTR      = (FLASH->OPTR & ~(FLASH_OPTR_nBOOT0 | FLASH_OPTR_nSWBOOT0 | FLASH_OPTR_RDP)) | (FLASH_OPTR_nBOOT0 | 0xbb);
            FLASH->WRP1AR    = 0x00030000;            
            FLASH->PCROP1ASR = 0x00000001;
            FLASH->PCROP1AER = 0x80000007;

            __DSB();
            __ISB();
            
            FLASH->SR = (FLASH_SR_EOP | FLASH_SR_OPERR | FLASH_SR_PROGERR | FLASH_SR_WRPERR | FLASH_SR_PGAERR | FLASH_SR_SIZERR | FLASH_SR_PGSERR | FLASH_SR_MISERR | FLASH_SR_FASTERR);
            FLASH->CR = FLASH_CR_OPTSTRT;
            
