GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
            while (FLASH->SR & FLASH_SR_BSY)
            {
            }
            
            FLASH->CR |= FLASH_CR_OBL_LAUNCH;
            
            __DSB();
            __ISB();
            
            FLASH->CR |= (FLASH_CR_LOCK | FLASH_CR_OPTLOCK);
            
            stm32wb_boot_reset();
        }
    }
    
#if (STM32WB_BOOT_FWU_CONFIG_APPLICATION == 1) || (STM32WB_BOOT_FWU_CONFIG_WIRELESS == 1)
    fwu_state = stm32wb_boot_fwu_state();

#if (STM32WB_BOOT_FWU_CONFIG_APPLICATION == 1)
    if ((fwu_state == STM32WB_FWU_STATE_TRIAL) || (fwu_state == STM32WB_FWU_STATE_REJECTED))
    {
        stm32wb_boot_fwu_rollback(STM32WB_FWU_STATUS_ERR_RESET);
    }
#endif /* (STM32WB_BOOT_FWU_CONFIG_APPLICATION == 1) */
    
    application_info = stm32wb_boot_application_info();

    if (fwu_state == STM32WB_FWU_STATE_STAGED)
    {
        stm32wb_boot_fwu_install(application_info);

        application_info = stm32wb_boot_application_info();
    }
#else /* (STM32WB_BOOT_FWU_CONFIG_APPLICATION == 1) || (STM32WB_BOOT_FWU_CONFIG_WIRELESS == 1) */
    application_info = stm32wb_boot_application_info();
#endif /* (STM32WB_BOOT_FWU_CONFIG_APPLICATION == 1) || (STM32WB_BOOT_FWU_CONFIG_WIRELESS == 1) */
    
    if (!application_info)
    {
#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1)
#if (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1)
        if (((const uint32_t*)(stm32wb_boot_info.application_base + STM32WB_BOOT_WIRELESS_PREFIX_OFFSET_MAGIC))[0] == STM32WB_BOOT_WIRELESS_PREFIX_MAGIC)
        {
            stm32wb_boot_fus_install(stm32wb_boot_info.application_base, ((const uint32_t*)(stm32wb_boot_info.application_base + STM32WB_BOOT_WIRELESS_PREFIX_OFFSET_SIZE))[0]);
        }
#endif /* (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1) */
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1) */
        
        stm32wb_boot_dfu(NULL);
    }

    if (stm32wb_boot_info.pins.dfu != STM32WB_GPIO_PIN_NONE)
    {
        stm32wb_boot_gpio_pin_configure(stm32wb_boot_info.pins.dfu, (STM32WB_GPIO_PUPD_PULLDOWN | STM32WB_GPIO_MODE_INPUT));
        
        boot_dfu = stm32wb_boot_gpio_pin_read(stm32wb_boot_info.pins.dfu);
        
        stm32wb_boot_gpio_pin_configure(stm32wb_boot_info.pins.dfu, (STM32WB_GPIO_MODE_ANALOG));
    
        if (boot_dfu)
        {
            stm32wb_boot_dfu(application_info);
        }
    }

    if (RCC->BDCR & RCC_BDCR_RTCEN)
    {
        if (RTC->BKP16R & STM32WB_RTC_BKP16R_DFU)
        {
            stm32wb_boot_dfu(application_info);
        }
    }

    RCC->APB1ENR1 &= ~RCC_APB1ENR1_RTCAPBEN;

    PWR->CR1 &= ~PWR_CR1_DBP;
    
    RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_HSI;
            
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSI)
    {
    }

    RCC->CR &= ~RCC_CR_PLLON;

    RCC->CRRCR &= ~RCC_CRRCR_HSI48ON;
    
    stm32wb_boot_leave(stm32wb_boot_info.application_base);
}

/************************************************************************************************************************************/

#if (STM32WB_BOOT_FWU_CONFIG_APPLICATION == 1)

#define STM32WB_BOOT_FWU_DICT_SIZE 8192

typedef struct _stm32wb_boot_fwu_context_t {
    bool                          encrypted;
    bool                          compressed;
    bool                          signature;
    bool                          restore;
    uint32_t                      in_current;
    uint32_t                      in_finish;
    uint32_t                      in_base;
    uint32_t                      in_limit;
    uint8_t                       in_size;
    uint8_t                       in_index;
    uint8_t                       in_shift;
    uint32_t                      in_bits;
    uint32_t                      in_data[64];
    uint32_t                      out_base;
    uint32_t                      out_limit;
    uint32_t                      swap_start;
    uint32_t                      swap_base;
    uint32_t                      swap_limit;
    const uint8_t                 *copy_current;
    const uint8_t                 *copy_finish;
    uint8_t                       *copy_base;
    uint8_t                       *dict_current;
    uint8_t                       *dict_base;
    uint8_t                       *dict_limit;
    stm32wb_boot_aes128_context_t aes128_ctx;
    uint32_t                      aes128_iv[4];
} stm32wb_boot_fwu_context_t;

static void __attribute__((noinline)) stm32wb_boot_fwu_data(stm32wb_boot_fwu_context_t *fwu_ctx, uint8_t *data, uint32_t count)
{
    uint32_t in_current = fwu_ctx->in_current;
    
    // address multiple of 16, count multiple of 16

    if (count > (fwu_ctx->in_limit - in_current))
    {
        count = fwu_ctx->in_limit - in_current;
    }

    if (count)
    {
        fwu_ctx->in_current += count;

        stm32wb_boot_nvm_read(in_current, data, count, false);
    }
}

static void __attribute__((noinline)) stm32wb_boot_fwu_decrypt(stm32wb_boot_fwu_context_t *fwu_ctx, uint8_t *data, uint32_t count)
{
    uint32_t in_current = fwu_ctx->in_current;
    uint32_t block;

    // address multiple of 16, count multiple of 16

    if (count > (fwu_ctx->in_limit - in_current))
    {
        count = fwu_ctx->in_limit - in_current;
    }
    
    if (count)
    {
        fwu_ctx->in_current += count;

        stm32wb_boot_nvm_read(in_current, data, count, false);

        if (fwu_ctx->encrypted)
        {
            block = (in_current - fwu_ctx->in_base) / 16;
        
            fwu_ctx->aes128_iv[3] = SWAP(block);
        
            stm32wb_boot_aes128_ctr_encrypt(&fwu_ctx->aes128_ctx, &fwu_ctx->aes128_iv[0], (const uint32_t*)data, (uint32_t*)data, count);
        }
    }
}

static void __attribute__((noinline)) stm32wb_boot_fwu_init(stm32wb_boot_fwu_context_t *fwu_ctx, uint32_t in_finish, uint32_t in_base, uint32_t in_limit, uint32_t out_base, uint32_t out_limit, uint32_t swap_start, uint32_t swap_base, uint32_t swap_limit)
{
    fwu_ctx->in_finish = in_finish;
    fwu_ctx->in_base = in_base;
    fwu_ctx->in_limit = in_limit;

    fwu_ctx->out_base = out_base;
    fwu_ctx->out_limit = out_limit;
    
    fwu_ctx->swap_start = swap_start;
    fwu_ctx->swap_base  = swap_base;
    fwu_ctx->swap_limit = swap_limit;

    fwu_ctx->copy_base = &stm32wb_boot_io2_data[0];
    fwu_ctx->dict_base = &stm32wb_boot_io8_data[0];
    fwu_ctx->dict_limit = &stm32wb_boot_io8_data[STM32WB_BOOT_FWU_DICT_SIZE];
}

static void __attribute__((noinline)) stm32wb_boot_fwu_save(stm32wb_boot_fwu_context_t *fwu_ctx, uint32_t * p_in_current_return, uint8_t * p_in_size_return, uint8_t * p_in_index_return, uint8_t * p_in_shift_return)
{
    *p_in_current_return = fwu_ctx->in_current;
    *p_in_size_return = fwu_ctx->in_size;
    *p_in_index_return = fwu_ctx->in_index;
    *p_in_shift_return = fwu_ctx->in_shift;
}

static void __attribute__((noinline)) stm32wb_boot_fwu_restore(stm32wb_boot_fwu_context_t *fwu_ctx, uint32_t in_current, uint8_t in_size, uint8_t in_index, uint8_t in_shift, uint32_t out_current)
{
    uint32_t count;
    
    fwu_ctx->in_current = in_current;
    fwu_ctx->in_size = in_size;
    fwu_ctx->in_index = in_index;
    fwu_ctx->in_shift = in_shift;

    // starting condition is in_index == 63 and in_shift == 32.
    if (!((fwu_ctx->in_shift == 32) && (fwu_ctx->in_index == (fwu_ctx->in_size -1))))
    {
        fwu_ctx->in_current -= (fwu_ctx->in_size * 4);
    
        stm32wb_boot_fwu_decrypt(fwu_ctx, (uint8_t*)&fwu_ctx->in_data[0], (fwu_ctx->in_size * 4));

        if (fwu_ctx->in_shift != 32)
        {
            fwu_ctx->in_bits = fwu_ctx->in_data[fwu_ctx->in_index] << fwu_ctx->in_shift;
        }
    }
    
    fwu_ctx->copy_current = NULL;
    fwu_ctx->copy_finish = NULL;

    count = STM32WB_BOOT_FWU_DICT_SIZE;

