GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
    if (count > (out_current - fwu_ctx->out_base))
    {
        count = (out_current - fwu_ctx->out_base);
    }

    stm32wb_boot_memcpy(fwu_ctx->dict_base, (const uint8_t*)(out_current - count), count);

    fwu_ctx->dict_current = fwu_ctx->dict_base + count;

    if (fwu_ctx->dict_current == fwu_ctx->dict_limit)
    {
        fwu_ctx->dict_current = fwu_ctx->dict_base;
    }
}

static uint32_t __attribute__((noinline, optimize("O3"))) stm32wb_boot_fwu_bits(stm32wb_boot_fwu_context_t *fwu_ctx, uint32_t count)
{
    uint32_t bits, size;

    if (fwu_ctx->in_shift == 32)
    {
        fwu_ctx->in_shift = 0;
        fwu_ctx->in_index++;

        if (fwu_ctx->in_index == fwu_ctx->in_size)
        {
            fwu_ctx->in_size = 64;
            fwu_ctx->in_index = 0;
            
            if (fwu_ctx->in_size > ((fwu_ctx->in_finish - fwu_ctx->in_current) / 4))
            {
                fwu_ctx->in_size = ((fwu_ctx->in_finish - fwu_ctx->in_current) / 4);
            }
            
            if (fwu_ctx->in_size)
            {
                stm32wb_boot_fwu_decrypt(fwu_ctx, (uint8_t*)&fwu_ctx->in_data[0], (fwu_ctx->in_size * 4));
            }
        }
        
        fwu_ctx->in_bits = fwu_ctx->in_data[fwu_ctx->in_index];

        bits = fwu_ctx->in_bits >> (32 - count);

        fwu_ctx->in_bits <<= count;
        fwu_ctx->in_shift += count;
    }
    else
    {
        size = 32 - fwu_ctx->in_shift;

        if (size > count)
        {
            size = count;
        }
        
        bits = fwu_ctx->in_bits >> (32 - size);

        fwu_ctx->in_bits <<= size;
        fwu_ctx->in_shift += size;

        if (size != count)
        {
            fwu_ctx->in_shift = 0;
            fwu_ctx->in_index++;
            
            if (fwu_ctx->in_index == fwu_ctx->in_size)
            {
                fwu_ctx->in_size = 64;
                fwu_ctx->in_index = 0;
                
                if (fwu_ctx->in_size > ((fwu_ctx->in_finish - fwu_ctx->in_current) / 4))
                {
                    fwu_ctx->in_size = ((fwu_ctx->in_finish - fwu_ctx->in_current) / 4);
                }
                
                if (fwu_ctx->in_size)
                {
                    stm32wb_boot_fwu_decrypt(fwu_ctx, (uint8_t*)&fwu_ctx->in_data[0], (fwu_ctx->in_size * 4));
                }
            }
            
            fwu_ctx->in_bits = fwu_ctx->in_data[fwu_ctx->in_index];
            
            bits = (bits << (count - size)) | (fwu_ctx->in_bits >> (32 - (count - size)));
            
            fwu_ctx->in_bits <<= (count - size);
            fwu_ctx->in_shift += (count - size);
        }
    }
    
    return bits;
}

static void __attribute__((noinline, optimize("O3"))) stm32wb_boot_fwu_uncompress(stm32wb_boot_fwu_context_t *fwu_ctx, uint8_t *data, uint32_t count, uint32_t swap_size)
{
    uint32_t code, literal, length, distance, offset, align;
    const uint8_t *copy_current;
    uint8_t *dict_current;
    uint8_t *data_e;

    if (!fwu_ctx->compressed)
    {
        stm32wb_boot_fwu_decrypt(fwu_ctx, data, count);

        return;
    }
    
    data_e = data + count;

    copy_current = fwu_ctx->copy_current;
    dict_current = fwu_ctx->dict_current;

    while (data < data_e)
    {
        if (copy_current != fwu_ctx->copy_finish)
        {
            literal = *copy_current++;

            if (copy_current == fwu_ctx->dict_limit)
            {
                copy_current = fwu_ctx->dict_base;
            }

            *data++ = literal;

            *dict_current++ = literal;

            if (dict_current == fwu_ctx->dict_limit)
            {
                dict_current = fwu_ctx->dict_base;
            }
            
            continue;
        }
        
        code = stm32wb_boot_fwu_bits(fwu_ctx, 3);

        if (code < 4)
        {
            literal = (code << 6) | stm32wb_boot_fwu_bits(fwu_ctx, 6);

            *data++ = literal;

            *dict_current++ = literal;

            if (dict_current == fwu_ctx->dict_limit)
            {
                dict_current = fwu_ctx->dict_base;
            }
        }
        else
        {
            if (code < 7)
            {
                length = (code - 4) + 2;
            }
            else
            {
                code = stm32wb_boot_fwu_bits(fwu_ctx, 2);

                if (code < 2)
                {
                    length = (code + 5);
                }
                else
                {
                    if (code == 2)
                    {
                        length = stm32wb_boot_fwu_bits(fwu_ctx, 3) + 7;
                    }
                    else
                    {
                        code = stm32wb_boot_fwu_bits(fwu_ctx, 7);

                        if (code < 112)
                        {
                            length = code + 15;
                        }
                        else
                        {
                            length = (((code - 112) << 7) + stm32wb_boot_fwu_bits(fwu_ctx, 7)) + 127;
                        }
                    }
                }
            }
            
            code = stm32wb_boot_fwu_bits(fwu_ctx, 9);
            
            if (code < 256)
            {
                distance = code + 1;
            }
            else
            {
                if (length == 2)
                {
                    distance = (((code - 256) << 3) + stm32wb_boot_fwu_bits(fwu_ctx, 3)) + 257;
                }
                else
                {
                    if (code < 384)
                    {
                        distance = (((code - 256) << 4) + stm32wb_boot_fwu_bits(fwu_ctx, 4)) + 257;
                    }
                    else
                    {
                        code = ((code - 384) << 6) + stm32wb_boot_fwu_bits(fwu_ctx, 6);
                        
                        if (code < 6144)
                        {
                            distance = code + 2305;
                        }
                        else
                        {
                            offset = (((code - 6144) << 11) + stm32wb_boot_fwu_bits(fwu_ctx, 11));
                            
                            if ((offset + length) > (fwu_ctx->out_limit - fwu_ctx->out_base))
                            {
                                // Avoid overfetching, but also avoid in/out size mismatches ... So fetch random stuff
                                copy_current = (const uint8_t*)fwu_ctx->out_base;
                            }
                            else
                            {
                                if (offset >= swap_size)
                                {
                                    copy_current = (const uint8_t*)(fwu_ctx->out_base + offset);
                                }
                                else
                                {
                                    if (offset < (fwu_ctx->swap_limit - fwu_ctx->swap_start))
                                    {
                                        copy_current = (const uint8_t*)(fwu_ctx->swap_start + offset);
                                    }
                                    else
                                    {
                                        copy_current = (const uint8_t*)(fwu_ctx->swap_base + (offset - (fwu_ctx->swap_limit - fwu_ctx->swap_start)));
                                    }
                                }

                                align = ((uint32_t)copy_current & 15);
                                
                                stm32wb_boot_nvm_read((uint32_t)copy_current - align, fwu_ctx->copy_base, ((align + length + 15) & ~15), true);

                                copy_current = fwu_ctx->copy_base + align;
                            }

