GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
                            fwu_ctx->copy_finish = copy_current + length;

                            continue;
                        }
                    }
                }
            }

            copy_current = dict_current - distance;

            if (copy_current < fwu_ctx->dict_base)
            {
                copy_current += STM32WB_BOOT_FWU_DICT_SIZE;
            }
            
            fwu_ctx->copy_finish = copy_current + length;

            if (fwu_ctx->copy_finish >= fwu_ctx->dict_limit)
            {
                fwu_ctx->copy_finish -= STM32WB_BOOT_FWU_DICT_SIZE;
            }
        }
    }

    fwu_ctx->copy_current = copy_current;
    fwu_ctx->dict_current = dict_current;
}

static uint32_t __attribute__((noinline)) stm32wb_boot_fwu_application(const stm32wb_application_info_t *application_info)
{
    stm32wb_fwu_prefix_t candidate_prefix;
    const stm32wb_application_vectors_t *candidate_vectors;
    const stm32wb_application_info_t *candidate_info;
    stm32wb_boot_fwu_context_t fwu_ctx;
    stm32wb_boot_sha256_context_t sha256_ctx;
    uint32_t sha256_hash[STM32WB_BOOT_SHA256_HASH_SIZE / 4];
    uint32_t aes128_key[4];
    uint32_t program_data[STM32WB_BOOT_NVM_PROGRAM_SIZE /4];
    uint32_t candidate_base, candidate_size, candidate_length, signature_size, program_size, program_count, size, offset, slot, crc32;
    uint32_t application_base, application_limit, application_size;
    uint32_t image_base, image_limit;
    uint8_t image_size, image_index, image_shift;
    uint32_t swap_start, swap_base, swap_limit, swap_current, swap_size, nvm_erase_size, nvm_program_size;

#if (STM32WB_BOOT_FWU_CONFIG_SFLASH == 1)
    if (stm32wb_boot_info.fwu_base < STM32WB_BOOT_SFLASH_LIMIT)
    {
        const stm32wb_boot_sflash_info_t *sflash_info;

        while ((((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_RANDOM))[0] &
                ((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_RANDOM))[1] &
                ((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_RANDOM))[2] &
                ((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_RANDOM))[3]) == 0xffffffff)
        {
            stm32wb_boot_random((uint8_t*)&aes128_key[0], sizeof(aes128_key));
            
            stm32wb_boot_flash_program(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_RANDOM + 0, (const uint8_t*)&aes128_key[0] + 0, 8);
            stm32wb_boot_flash_program(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_RANDOM + 8, (const uint8_t*)&aes128_key[0] + 8, 8);
        }

        stm32wb_boot_nvm_set_key((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_RANDOM));
        
        sflash_info = stm32wb_boot_sflash_init();

        nvm_erase_size = sflash_info->erase_size;
        nvm_program_size = sflash_info->page_size;
    }
    else
#endif /* (STM32WB_BOOT_FWU_CONFIG_SFLASH == 1) */
    {
        nvm_erase_size = STM32WB_BOOT_FLASH_ERASE_SIZE;
        nvm_program_size = sizeof(program_data);
    }

    if (((const stm32wb_application_vectors_t*)stm32wb_boot_vectors)->magic & STM32WB_BOOT_OPTION_SIGNATURE_MASK)
    {
        signature_size = STM32WB_APPLICATION_SIGNATURE_SIZE_ECC256;
    }
    else
    {
        signature_size = STM32WB_APPLICATION_SIGNATURE_SIZE_NONE;
    }
            
    if (((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_SWAP))[0] == 0xffffffff)
    {
        stm32wb_boot_nvm_read(stm32wb_boot_info.fwu_base, (uint8_t*)&candidate_prefix, sizeof(candidate_prefix), false);
            
        if ((candidate_prefix.magic & ~STM32WB_FWU_TYPE_MASK) == ((((const stm32wb_boot_vectors_t*)stm32wb_boot_vectors)->magic & ~(STM32WB_BOOT_TAG_MASK | STM32WB_BOOT_TYPE_MASK)) | STM32WB_FWU_TAG_FWU))
        {
            candidate_base = candidate_prefix.base;
            candidate_size = candidate_prefix.size;
            candidate_length = candidate_prefix.length;

            if (candidate_base != stm32wb_boot_info.application_base)
            {
                return STM32WB_FWU_STATUS_ERR_TARGET;
            }

            if ((candidate_size < (sizeof(stm32wb_application_vectors_t) + sizeof(stm32wb_application_info_t))) || ((candidate_size + signature_size) > (stm32wb_boot_info.application_limit - stm32wb_boot_info.application_base)) || (candidate_size & 15))
            {
                return STM32WB_FWU_STATUS_ERR_FILE;
            }

            if (candidate_length & 15)
            {
                return STM32WB_FWU_STATUS_ERR_FILE;
            }
        }
        else
        {
#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 0)
            stm32wb_boot_nvm_read(stm32wb_boot_info.fwu_base, (uint8_t*)&program_data[0], sizeof(stm32wb_application_vectors_t), false);

            candidate_vectors = (const stm32wb_application_vectors_t*)(&program_data[0]);

            if (candidate_vectors->magic == ((((const stm32wb_boot_vectors_t*)stm32wb_boot_vectors)->magic & ~STM32WB_BOOT_TYPE_MASK) | STM32WB_APPLICATION_TYPE_APPLICATION))
            {
                candidate_base = candidate_vectors->base;
                candidate_size = candidate_vectors->size;
            
                if (candidate_base != stm32wb_boot_info.application_base)
                {
                    return STM32WB_FWU_STATUS_ERR_TARGET;
                }
                
                if ((candidate_size < (sizeof(stm32wb_application_vectors_t) + sizeof(stm32wb_application_info_t))) || ((candidate_size + signature_size) > (stm32wb_boot_info.application_limit - stm32wb_boot_info.application_base)) || (candidate_size & 15))
                {
                    return STM32WB_FWU_STATUS_ERR_FILE;
                }
                
                stm32wb_boot_memset(&candidate_prefix, 0, sizeof(candidate_prefix));
                
                candidate_prefix.size = candidate_size;
                candidate_prefix.length = candidate_size + signature_size;
            }
            else
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 0) */
            {
                return STM32WB_FWU_STATUS_ERR_FILE;
            }
        }
        
#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 0)
        if (!candidate_prefix.magic)
        {
            image_base = stm32wb_boot_info.fwu_base;
        }
        else
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 0) */
        {
            image_base = stm32wb_boot_info.fwu_base + sizeof(stm32wb_fwu_prefix_t);
        }

        image_limit = image_base + candidate_prefix.length; 

