GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
        image_size = 64;
        image_index = 63;
        image_shift = 32;

        fwu_ctx.encrypted = !!(candidate_prefix.magic & STM32WB_FWU_OPTION_SIGNATURE_MASK);
        fwu_ctx.compressed = !!(candidate_prefix.magic & STM32WB_FWU_TYPE_COMPRESSED);
        fwu_ctx.signature = !!(((const stm32wb_application_vectors_t*)stm32wb_boot_vectors)->magic & STM32WB_BOOT_OPTION_SIGNATURE_MASK);
        fwu_ctx.restore = true;
        
        if (fwu_ctx.encrypted)
        {
            stm32wb_boot_aes128_get_key(&candidate_prefix.nonce[0], &aes128_key[0]);

            stm32wb_boot_aes128_set_key(&fwu_ctx.aes128_ctx, &aes128_key[0]);

            fwu_ctx.aes128_iv[0] = 0;
            fwu_ctx.aes128_iv[1] = 0;
            fwu_ctx.aes128_iv[2] = 0;
            fwu_ctx.aes128_iv[3] = 0;
        }

        if (fwu_ctx.signature)
        {
            stm32wb_boot_sha256_init(&sha256_ctx);
        }
        else
        {
            crc32 = 0xffffffff;
        }
        
        stm32wb_boot_fwu_init(&fwu_ctx, (image_limit - (sizeof(stm32wb_application_info_t) + signature_size)), image_base, image_limit, stm32wb_boot_info.application_base, stm32wb_boot_info.application_limit, 0, 0, 0);
        stm32wb_boot_fwu_restore(&fwu_ctx, image_base, image_size, image_index, image_shift, stm32wb_boot_info.application_base);

        for (offset = 0, application_size = candidate_size - sizeof(stm32wb_application_info_t); application_size; application_size -= program_size, offset += program_size)
        {
            program_size = sizeof(program_data);

            if (program_size > application_size)
            {
                program_size = application_size;
            }

            stm32wb_boot_fwu_uncompress(&fwu_ctx, (uint8_t*)&program_data[0], program_size, 0);

            if (fwu_ctx.signature)
            {
                stm32wb_boot_sha256_update(&sha256_ctx, (const uint8_t*)&program_data[0], program_size);
            }
            else
            {
                crc32 = stm32wb_boot_crc32((const uint8_t*)&program_data[0], program_size, crc32);
            }
            
            if (offset == 0)
            {
                candidate_vectors = (const stm32wb_application_vectors_t*)&program_data[0];

                if ((candidate_vectors->magic != ((((const stm32wb_boot_vectors_t*)stm32wb_boot_vectors)->magic & ~STM32WB_BOOT_TYPE_BOOT) | STM32WB_APPLICATION_TYPE_APPLICATION)) ||
                    (candidate_vectors->base != candidate_prefix.base) ||
                    (candidate_vectors->size != candidate_prefix.size))
                {
                    return STM32WB_FWU_STATUS_ERR_FILE;
                }
            }
        }

        stm32wb_boot_fwu_data(&fwu_ctx, (uint8_t*)&program_data[0], (sizeof(stm32wb_application_info_t) + signature_size));

        if (candidate_prefix.length != (fwu_ctx.in_current - fwu_ctx.in_base))
        {
            return STM32WB_FWU_STATUS_ERR_FILE;
        }
        
        candidate_info = (const stm32wb_application_info_t*)&program_data[0];
        
        if (stm32wb_boot_memcmp(&stm32wb_boot_info.uuid[0], &candidate_info->uuid[0], sizeof(stm32wb_boot_info.uuid)))
        {
            return STM32WB_FWU_STATUS_ERR_TARGET;
        }

        if (application_info)
        {
            if (application_info->sequence > candidate_info->sequence)
            {
                return STM32WB_FWU_STATUS_ERR_FILE;
            }
        }

        if (fwu_ctx.signature)
        {
            stm32wb_boot_sha256_update(&sha256_ctx, (const uint8_t*)&program_data[0], sizeof(stm32wb_application_info_t));
            stm32wb_boot_sha256_final(&sha256_ctx, sha256_hash);

            if (!stm32wb_boot_ecc256_verify((const stm32wb_boot_ecc256_key_t *)stm32wb_boot_info.ecc256_key, (const uint32_t*)((const uint8_t*)candidate_info + sizeof(stm32wb_application_info_t)), sha256_hash))
            {
                return STM32WB_FWU_STATUS_ERR_FILE;
            }
        }
        else
        {
            crc32 = stm32wb_boot_crc32((const uint8_t*)&program_data[0], (sizeof(stm32wb_application_info_t) - sizeof(uint32_t)), crc32);

            if (candidate_info->crc32 != crc32)
            {
                return STM32WB_FWU_STATUS_ERR_FILE;
            }
        }
        
        for (offset = 0; offset < sizeof(candidate_prefix); offset += 8)
        {
            stm32wb_boot_flash_program(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_PREFIX + offset, (const uint8_t*)&candidate_prefix + offset, 8);
        }

        if (stm32wb_boot_memcmp((const uint8_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_PREFIX), (const uint8_t*)&candidate_prefix, sizeof(candidate_prefix)))
        {
            return STM32WB_FWU_STATUS_ERR_PROGRAM;
        }
    }
    
    /**********************************************************************************************************************************/

    stm32wb_boot_memcpy(&candidate_prefix, (const uint8_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_PREFIX), sizeof(candidate_prefix));

#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 0)
    if (!candidate_prefix.magic)
    {
        image_base = stm32wb_boot_info.fwu_base;
    }
    else
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 0) */
    {
        image_base = stm32wb_boot_info.fwu_base + sizeof(stm32wb_fwu_prefix_t);
    }

    image_limit = image_base + candidate_prefix.length;
    
    image_size = 64;
    image_index = 63;
    image_shift = 32;

    fwu_ctx.encrypted = !!(candidate_prefix.magic & STM32WB_FWU_OPTION_SIGNATURE_MASK);
    fwu_ctx.compressed = !!(candidate_prefix.magic & STM32WB_FWU_TYPE_COMPRESSED);
    fwu_ctx.signature = !!(((const stm32wb_application_vectors_t*)stm32wb_boot_vectors)->magic & STM32WB_BOOT_OPTION_SIGNATURE_MASK);
    fwu_ctx.restore = true;

    if (fwu_ctx.encrypted)
    {
        stm32wb_boot_aes128_get_key(&candidate_prefix.nonce[0], &aes128_key[0]);
        
        stm32wb_boot_aes128_set_key(&fwu_ctx.aes128_ctx, &aes128_key[0]);
        
        fwu_ctx.aes128_iv[0] = 0;
        fwu_ctx.aes128_iv[1] = 0;
        fwu_ctx.aes128_iv[2] = 0;
        fwu_ctx.aes128_iv[3] = 0;
    }
    
    swap_start = (image_limit + (nvm_erase_size-1)) & ~(nvm_erase_size-1);
    swap_base  = stm32wb_boot_info.fwu_base;
    swap_limit = stm32wb_boot_info.fwu_limit;

