GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
    swap_current = swap_start;
    swap_size = 0;

    stm32wb_boot_fwu_init(&fwu_ctx, (image_limit - (sizeof(stm32wb_application_info_t) + signature_size)), image_base, image_limit, stm32wb_boot_info.application_base, stm32wb_boot_info.application_limit, swap_start, swap_base, swap_limit);

    application_base = stm32wb_boot_info.application_base;
    application_limit = stm32wb_boot_info.application_base + candidate_prefix.size - sizeof(stm32wb_application_info_t);
    application_size = candidate_prefix.size + signature_size;

    for (slot = 0; application_size; application_size -= size, application_base += size, slot += 8)
    {
        size = STM32WB_BOOT_FLASH_ERASE_SIZE;

        if (size > application_size)
        {
            size = application_size;
        }

        if (((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_SWAP + slot))[0] == 0xffffffff)
        {
            if (!(swap_current & (nvm_erase_size-1)))
            {
                if (!stm32wb_boot_nvm_erase(swap_current))
                {
                    return STM32WB_FWU_STATUS_ERR_ERASE;
                }
            }

            for (offset = 0; offset < size; offset += nvm_program_size)
            {
                if (!stm32wb_boot_nvm_program(swap_current + offset, ((const uint8_t*)application_base + offset), nvm_program_size, true))
                {
                    return STM32WB_FWU_STATUS_ERR_PROGRAM;
                }
            }
            
            program_data[0] = swap_current;
            program_data[1] = 0;
            
            if (!stm32wb_boot_flash_program(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_SWAP + slot, (const uint8_t*)program_data, 8))
            {
                return STM32WB_FWU_STATUS_ERR_PROGRAM;
            }
        }
        
        swap_current += STM32WB_BOOT_FLASH_ERASE_SIZE;
        swap_size += STM32WB_BOOT_FLASH_ERASE_SIZE;
        
        if (swap_current == swap_limit)
        {
            swap_current = swap_base;
        }
        
        if (((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_COPY + slot))[0] == 0xffffffff)
        {
            if (!stm32wb_boot_flash_erase(application_base))
            {
                return STM32WB_FWU_STATUS_ERR_ERASE;
            }

            if (fwu_ctx.restore)
            {
                fwu_ctx.restore = false;

                stm32wb_boot_fwu_restore(&fwu_ctx, image_base, image_size, image_index, image_shift, application_base);
            }
                
            for (offset = 0; offset < size; offset += program_size)
            {
                program_size = sizeof(program_data);

                if (program_size > (size - offset))
                {
                    program_size = (size - offset);
                }

                if ((application_base + offset) < application_limit)
                {
                    program_count = program_size;
                
                    if (program_count > ((application_limit - application_base) - offset))
                    {
                        program_count = ((application_limit - application_base) - offset);
                    }

                    if (program_count)
                    {
                        stm32wb_boot_fwu_uncompress(&fwu_ctx, (uint8_t*)&program_data[0], program_count, swap_size);
                    }
                }
                else
                {
                    program_count = 0;
                }

                if (program_count != program_size)
                {
                    stm32wb_boot_fwu_data(&fwu_ctx, (uint8_t*)&program_data[0] + program_count, (program_size - program_count));
                }
                
                if (!stm32wb_boot_flash_program(application_base + offset, (const uint8_t*)program_data, program_size))
                {
                    return STM32WB_FWU_STATUS_ERR_PROGRAM;
                }
            }

            stm32wb_boot_fwu_save(&fwu_ctx, &image_base, &image_size, &image_index, &image_shift);
            
            program_data[0] = image_base;
            program_data[1] = (image_size << 0) | (image_index << 8) | (image_shift << 16);
            
            if (!stm32wb_boot_flash_program(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_COPY + slot, (const uint8_t*)program_data, 8))
            {
                return STM32WB_FWU_STATUS_ERR_PROGRAM;
            }
        }
        else
        {
            program_data[0] = ((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_COPY + slot))[0];
            program_data[1] = ((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_COPY + slot))[1];

            image_base = program_data[0];
            image_size  = (program_data[1] >> 0) & 0xff;
            image_index = (program_data[1] >> 8) & 0xff;
            image_shift = (program_data[1] >> 16) & 0xff;
        }
    }
    
    return STM32WB_FWU_STATUS_NO_ERROR;
}

static void stm32wb_boot_fwu_rollback(uint32_t status)
{
    uint32_t application_base, application_limit, swap_current, slot;
    uint32_t program_data[2];

#if (STM32WB_BOOT_FWU_CONFIG_SFLASH == 1)
    if (stm32wb_boot_info.fwu_base < STM32WB_BOOT_SFLASH_LIMIT)
    {
        stm32wb_boot_nvm_set_key((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_RANDOM));

        stm32wb_boot_sflash_init();
    }
#endif /* (STM32WB_BOOT_FWU_CONFIG_SFLASH == 1) */
    
    application_base = stm32wb_boot_info.application_base;
    application_limit = stm32wb_boot_info.application_limit;

    for (slot = 0; application_base < application_limit; application_base += STM32WB_FLASH_PAGE_SIZE, slot += 8)
    {
        if (((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_SWAP + slot))[0] == 0xffffffff)
        {
            break;
        }

        swap_current = ((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_SWAP + slot))[0];
        
        stm32wb_boot_flash_erase(application_base);

        stm32wb_boot_nvm_read(swap_current, (uint8_t*)&stm32wb_boot_io8_data[0], STM32WB_BOOT_FLASH_ERASE_SIZE, true);

        stm32wb_boot_flash_program(application_base, (const uint8_t*)&stm32wb_boot_io8_data[0], STM32WB_BOOT_FLASH_ERASE_SIZE);
    }
        
    program_data[0] = status;
    program_data[1] = 0x00000000;

