GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
    stm32wb_boot_flash_program(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_FAILED, (const uint8_t*)&program_data[0], 8);
}

#endif /* (STM32WB_BOOT_FWU_CONFIG_APPLICATION == 1) */

#if (STM32WB_BOOT_FWU_CONFIG_APPLICATION == 1) || (STM32WB_BOOT_FWU_CONFIG_WIRELESS == 1)

static uint32_t stm32wb_boot_fwu_state(void)
{
    if (((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_UPDATED))[0] != 0xffffffff)
    {
        return STM32WB_FWU_STATE_UPDATED;
    }

    if (((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_FAILED))[0] != 0xffffffff)
    {
        return STM32WB_FWU_STATE_FAILED;
    }

    if (((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_REJECTED))[0] != 0xffffffff)
    {
        return STM32WB_FWU_STATE_REJECTED;
    }

    if (((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_TRIAL))[0] != 0xffffffff)
    {
        return STM32WB_FWU_STATE_TRIAL;
    }

    if (((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_STAGED))[0] != 0xffffffff)
    {
        return STM32WB_FWU_STATE_STAGED;
    }

    if (((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_CANDIDATE))[0] != 0xffffffff)
    {
        return STM32WB_FWU_STATE_CANDIDATE;
    }

    if (((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_WRITING))[0] != 0xffffffff)
    {
        return STM32WB_FWU_STATE_WRITING;
    }

    if (((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_READY))[0] != 0xffffffff)
    {
        return STM32WB_FWU_STATE_READY;
    }

    return STM32WB_FWU_STATE_FAILED;
}

static uint32_t stm32wb_boot_fwu_install(const stm32wb_application_info_t *application_info)
{
    uint32_t status, offset, data[2];

    status = STM32WB_FWU_STATUS_ERR_INTERNAL;

#if (STM32WB_BOOT_FWU_CONFIG_APPLICATION == 1)
    if (((const uint8_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_WRITING))[0] == STM32WB_FWU_COMPONENT_APPLICATION)
    {
        status = stm32wb_boot_fwu_application(application_info);

        data[0] = status;
        data[1] = 0x00000000;
        
        if (status == STM32WB_FWU_STATUS_NO_ERROR)
        {
            if (((const uint8_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_STAGED))[0] == STM32WB_FWU_MODE_TRIAL)
            {
                offset = STM32WB_FWU_STATUS_OFFSET_TRIAL;
            }
            else
            {
                offset = STM32WB_FWU_STATUS_OFFSET_UPDATED;
            }
            
            stm32wb_boot_flash_program(stm32wb_boot_info.fwu_status + offset, (const uint8_t*)(&data[0]), 8);
        }
        else
        {
            stm32wb_boot_flash_program(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_REJECTED, (const uint8_t*)(&data[0]), 8);

            stm32wb_boot_fwu_rollback(status);
        }
    }
#endif /* (STM32WB_BOOT_FWU_CONFIG_APPLICATION == 1) */
    
#if (STM32WB_BOOT_FWU_CONFIG_WIRELESS == 1)
    if (((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_WRITING))[0] == STM32WB_FWU_COMPONENT_WIRELESS)
    {
        status = stm32wb_boot_fus_install(stm32wb_boot_info.fwu_base, ((const uint32_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_CANDIDATE))[0]);

        data[0] = status;
        data[1] = 0x00000000;
        
        if (status == STM32WB_FWU_STATUS_NO_ERROR)
        {
            offset = STM32WB_FWU_STATUS_OFFSET_UPDATED;
        }
        else
        {
            offset = STM32WB_FWU_STATUS_OFFSET_FAILED;
        }
        
        stm32wb_boot_flash_program(stm32wb_boot_info.fwu_status + offset, (const uint8_t*)(&data[0]), 8);

        stm32wb_boot_reset();
    }
#endif /* (STM32WB_BOOT_FWU_CONFIG_WIRELESS == 1) */

    return status;
}

#endif /* (STM32WB_BOOT_FWU_CONFIG_APPLICATION == 1) || (STM32WB_BOOT_FWU_CONFIG_WIRELESS == 1) */

/************************************************************************************************************************************/

#if (STM32WB_BOOT_FWU_CONFIG_WIRELESS == 1) || (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1)

#define stm32wb_ipcc_device            stm32wb_boot_ipcc_device

#define stm32wb_ipcc_sys_enable        stm32wb_boot_ipcc_sys_enable
#define stm32wb_ipcc_sys_disable       stm32wb_boot_ipcc_sys_disable
#define stm32wb_ipcc_sys_state         stm32wb_boot_ipcc_sys_state
#define stm32wb_ipcc_sys_info          stm32wb_boot_ipcc_sys_info
#define stm32wb_ipcc_sys_command       stm32wb_boot_ipcc_sys_command

#define stm32wb_ipcc_fus_state         stm32wb_boot_ipcc_fus_state
#define stm32wb_ipcc_fus_command       stm32wb_boot_ipcc_fus_command

#define MB_QueueInit                   stm32wb_boot_ipcc_queue_init
#define MB_QueueIsEmpty                stm32wb_boot_ipcc_queue_is_empty
#define MB_QueueInsert                 stm32wb_boot_ipcc_queue_insert
#define MB_QueueRemove                 stm32wb_boot_ipcc_queue_remove
#define MB_QueueCopy                   stm32wb_boot_ipcc_queue_copy

#include "stm32wb_ipcc.c"

/************************************************************************************************************************************/

static bool stm32wb_boot_fus_image(uint32_t image_base, uint32_t image_size, stm32wb_ipcc_fus_image_t * p_fus_image_return)
{
    const stm32wb_ipcc_fus_signature_t *signature;
    uint32_t magic, count;

    image_size = (image_size + 15) & ~15;
    
    count = 1024;
    
    if (count > image_size)
    {
        count = image_size;
    }

    stm32wb_boot_nvm_read((image_base + image_size - count), (uint8_t*)&stm32wb_boot_io8_data[0], count, false);
    
    for (signature = (const stm32wb_ipcc_fus_signature_t*)((uint8_t*)&stm32wb_boot_io8_data[0] + count - sizeof(stm32wb_ipcc_fus_signature_t));
         ((uint8_t*)&stm32wb_boot_io8_data[0] <= (uint8_t*)signature);
         signature = (const stm32wb_ipcc_fus_signature_t*)((const uint8_t*)signature - 4)) 
    {
        if (signature->Magic == STM32WB_IPCC_FUS_MAGIC_STM_SIGNATURE)
        {
            magic = ((const stm32wb_ipcc_fus_image_t*)((const uint8_t*)signature - (signature->MemorySize & 0x000000ff) - sizeof(stm32wb_ipcc_fus_image_t)))->Magic;
            
            if ((magic == STM32WB_IPCC_FUS_MAGIC_WIRELESS_IMAGE) || (magic == STM32WB_IPCC_FUS_MAGIC_FUS_IMAGE))
            {
                if (p_fus_image_return)
                {
                    stm32wb_boot_memcpy(p_fus_image_return, (const stm32wb_ipcc_fus_image_t*)((const uint8_t*)signature - (signature->MemorySize & 0x000000ff) - sizeof(stm32wb_ipcc_fus_image_t)), sizeof(stm32wb_ipcc_fus_image_t));
                }

