GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
                return true;
            }
        }
    }

    return false;
}

static bool stm32wb_boot_fus_state(stm32wb_ipcc_fus_state_t *p_state_return)
{
    stm32wb_ipcc_sys_command_t command;
    
    command.opcode = STM32WB_IPCC_SYS_OPCODE_FUS_GET_STATE;
    command.cparam = NULL;
    command.clen = 0;
    command.rparam = (void*)p_state_return;
    command.rsize = sizeof(stm32wb_ipcc_fus_state_t);

    stm32wb_ipcc_sys_command(&command);

    return (command.status == STM32WB_IPCC_SYS_COMMAND_STATUS_SUCCESS);
}

static bool stm32wb_boot_fus_command(uint32_t opcode)
{
    stm32wb_ipcc_sys_command_t command;
    
    command.opcode = opcode;
    command.cparam = NULL;
    command.clen = 0;
    command.rparam = NULL;
    command.rsize = 0;

    stm32wb_ipcc_sys_command(&command);

    return (command.status == STM32WB_IPCC_SYS_COMMAND_STATUS_SUCCESS);
}

static uint32_t stm32wb_boot_fus_upgrade(uint32_t image_base, uint32_t image_size, const stm32wb_ipcc_fus_image_t *fus_image)
{
    stm32wb_ipcc_fus_state_t fus_state;
    stm32wb_ipcc_sys_info_t sys_info;
    uint32_t sys_state, fus_address, fus_base, fus_limit, image_address, program_size;
    uint32_t program_data[STM32WB_BOOT_NVM_PROGRAM_SIZE / 4];
    
    stm32wb_boot_ipcc_sys_enable();

    if (!stm32wb_boot_fus_state(&fus_state))
    {
        return STM32WB_FWU_STATUS_ERR_INTERNAL;
    }
    
    if (!stm32wb_boot_ipcc_sys_info(&sys_info))
    {
        return STM32WB_FWU_STATUS_ERR_INTERNAL;
    }

    sys_state = STM32WB_IPCC_SYS_STATE_FUS;
    
    do
    {
        if (fus_state.State == STM32WB_IPCC_FUS_STATE_ERROR)
        {
            if (fus_state.ErrorCode == STM32WB_IPCC_FUS_ERROR_CODE_NOT_RUNNING)
            {
                sys_state = STM32WB_IPCC_SYS_STATE_WIRELESS;
                
                break;
            }

            return STM32WB_FWU_STATUS_ERR_INTERNAL;
        }

        if (fus_state.State != STM32WB_IPCC_FUS_STATE_IDLE)
        {
            stm32wb_boot_udelay(100000);
            
            if (!stm32wb_boot_fus_state(&fus_state))
            {
                return STM32WB_FWU_STATUS_ERR_INTERNAL;
            }
        }
    }
    while (fus_state.State != STM32WB_IPCC_FUS_STATE_IDLE);
    
    if (((volatile uint32_t*)(image_base + STM32WB_BOOT_WIRELESS_PREFIX_OFFSET_STATUS))[0] == 0xffffffff)
    {
        // fus_limit = 0x08000000 + (FLASH->SFR & FLASH_SFR_SFSA) * STM32WB_FLASH_PAGE_SIZE;
        fus_limit = 0x080f4000;
        
        if (fus_image->Magic == STM32WB_IPCC_FUS_MAGIC_FUS_IMAGE)
        {
            if ((fus_image->Version & 0xffffff00) < (sys_info.FusVersion & 0xffffff00))
            {
                return STM32WB_FWU_STATUS_ERR_FILE;
            }

            fus_base = 0x080ec000; // max 32k
        }
        else
        {
            if (fus_image->Info1 == 0x5afeb007)
            {
                if ((fus_image->Version & 0xffffff00) < (sys_info.SafeBootVersion & 0xffffff00))
                {
                    return STM32WB_FWU_STATUS_ERR_FILE;
                }

                fus_base = 0x080f0000; // max 16k
            }
            else
            {
                fus_base = fus_limit - (fus_image->MemorySize & 0x000000ff) * STM32WB_FLASH_PAGE_SIZE;

                if (fus_base < stm32wb_boot_info.wireless_base)
                {
                    return STM32WB_FWU_STATUS_ERR_FILE;
                }
            }
        }

        if (sys_state == STM32WB_IPCC_SYS_STATE_WIRELESS)
        {
            /* Reboot into FUS.
             */
            
            if (!stm32wb_boot_fus_state(&fus_state))
            {
                return STM32WB_FWU_STATUS_ERR_INTERNAL;
            }
            
            while (1)
            {
            }
        }
        
        if (sys_info.WirelessStackMemorySize)
        {
            if (!stm32wb_boot_fus_command(STM32WB_IPCC_SYS_OPCODE_FUS_FW_DELETE))
            {
                return STM32WB_FWU_STATUS_ERR_INTERNAL;
            }

            do
            {
                stm32wb_boot_udelay(100000);
                
                if (!stm32wb_ipcc_fus_state(&fus_state))
                {
                    return STM32WB_FWU_STATUS_ERR_INTERNAL;
                }
                
                if (fus_state.State == STM32WB_IPCC_FUS_STATE_ERROR)
                {
                    return STM32WB_FWU_STATUS_ERR_INTERNAL;
                }
            }
            while (fus_state.State != STM32WB_IPCC_FUS_STATE_IDLE);

            /* If we get here throu an idle-state, CM0+ for some reason did not reset.
             * Hence use CM4 to do so.
             */
            stm32wb_boot_reset();
        }

        /* FUS does something odd with erased pages, so that a simple blank detection will
         * not work. Just brute force erase the whole area instead of trying to be smart.
         */
        for (fus_address = fus_base; fus_address < fus_limit; fus_address += STM32WB_BOOT_FLASH_ERASE_SIZE)
        {
            if (!stm32wb_boot_flash_erase(fus_address))
            {
                return STM32WB_FWU_STATUS_ERR_ERASE;
            }
        }

        for (fus_address = fus_base, image_address = image_base; fus_address < fus_limit; fus_address += program_size, image_address += program_size)
        {
            program_size = sizeof(program_data);

            if (program_size > (fus_limit - fus_address))
            {
                program_size = (fus_limit - fus_address);
            }
            
            stm32wb_boot_nvm_read(image_address, (uint8_t*)&program_data[0], program_size, false);

            if (!stm32wb_boot_flash_program(fus_address, (const uint8_t *)&program_data[0], program_size))
            {
                return STM32WB_FWU_STATUS_ERR_PROGRAM;
            }
        }
        
        /* Ok, all the prepwork had been done. The image has been verified (sort of), FUS is booted, and the
         * previous wireless stack has been deleted.
         */
        program_data[0] = 0x00000000;
        program_data[1] = 0x00000000;

        if (!stm32wb_boot_flash_program(image_base + STM32WB_BOOT_WIRELESS_PREFIX_OFFSET_STATUS, (const uint8_t*)&program_data[0], 8))
        {
            return STM32WB_FWU_STATUS_ERR_PROGRAM;
        }

