GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
        if (!stm32wb_boot_fus_command(STM32WB_IPCC_SYS_OPCODE_FUS_FW_UPGRADE))
        {
            return STM32WB_FWU_STATUS_ERR_INTERNAL;
        }

        do
        {
            stm32wb_boot_udelay(100000);

            if (!stm32wb_ipcc_fus_state(&fus_state))
            {
                return STM32WB_FWU_STATUS_ERR_INTERNAL;
            }
            
            if (fus_state.State == STM32WB_IPCC_FUS_STATE_ERROR)
            {
                return STM32WB_FWU_STATUS_ERR_INTERNAL;
            }
        }
        while (fus_state.State != STM32WB_IPCC_FUS_STATE_IDLE);

        /* If we get here throu an idle-state, CM0+ for some reason did not reset.
         * Hence use CM4 to do so.
         */
        stm32wb_boot_reset();
    }

    if (sys_info.WirelessStackMemorySize)
    {
        if (sys_state != STM32WB_IPCC_SYS_STATE_WIRELESS)
        {
            if(!stm32wb_boot_fus_command(STM32WB_IPCC_SYS_OPCODE_FUS_START_WS))
            {
                return STM32WB_FWU_STATUS_ERR_INTERNAL;
            }
        }
    }

    return STM32WB_FWU_STATUS_NO_ERROR;
}

static uint32_t __attribute__((noinline)) stm32wb_boot_fus_install(uint32_t image_base, uint32_t image_size)
{
    stm32wb_ipcc_fus_image_t fus_image;
    uint32_t status;
    uint32_t program_data[2];
    
#if (STM32WB_BOOT_FWU_CONFIG_SFLASH == 1)
    if (image_base < STM32WB_BOOT_SFLASH_LIMIT)
    {
        stm32wb_boot_sflash_init();
    }
#endif /* (STM32WB_BOOT_FWU_CONFIG_SFLASH == 1) */

    if (!stm32wb_boot_fus_image(image_base, image_size, &fus_image))
    {
        status = STM32WB_FWU_STATUS_ERR_FILE;
    }
    else
    {
        status = stm32wb_boot_fus_upgrade(image_base, image_size, &fus_image);
    }

#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1)
    /* On a DFU STANDALONE config, nuke the MAGIC, so that stm32wb_boot_application() is not
     * retrying an installion (whether successful or not).
     */
    program_data[0] = 0x00000000;
    program_data[1] = 0x00000000;

    stm32wb_boot_flash_program(image_base + STM32WB_BOOT_WIRELESS_PREFIX_OFFSET_MAGIC, (const uint8_t*)&program_data[0], 8);
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1) */

    return status;
}

#endif /* (STM32WB_BOOT_FWU_CONFIG_WIRELESS == 1) || (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1) */

/************************************************************************************************************************************/

/************************************************************************************************************************************/

#define stm32wb_gpio_pin_configure     stm32wb_boot_gpio_pin_configure
#define stm32wb_gpio_pin_input         stm32wb_boot_gpio_pin_input
#define stm32wb_gpio_pin_output        stm32wb_boot_gpio_pin_output
#define stm32wb_gpio_pin_alternate     stm32wb_boot_gpio_pin_alternate
#define stm32wb_gpio_pin_write         stm32wb_boot_gpio_pin_write
#define stm32wb_gpio_pin_read          stm32wb_boot_gpio_pin_read

#define stm32wb_usbd_dcd_device        stm32wb_boot_usbd_dcd_device

#define stm32wb_usbd_dcd_address       stm32wb_boot_usbd_dcd_address
#define stm32wb_usbd_dcd_configure     stm32wb_boot_usbd_dcd_configure
#define stm32wb_usbd_dcd_connect       stm32wb_boot_usbd_dcd_connect
#define stm32wb_usbd_dcd_disable       stm32wb_boot_usbd_dcd_disable
#define stm32wb_usbd_dcd_disconnect    stm32wb_boot_usbd_dcd_disconnect
#define stm32wb_usbd_dcd_enable        stm32wb_boot_usbd_dcd_enable
#define stm32wb_usbd_dcd_event         stm32wb_boot_usbd_dcd_event
#define stm32wb_usbd_dcd_ep0_count     stm32wb_boot_usbd_dcd_ep0_count
#define stm32wb_usbd_dcd_ep0_receive   stm32wb_boot_usbd_dcd_ep0_receive
#define stm32wb_usbd_dcd_ep0_stall     stm32wb_boot_usbd_dcd_ep0_stall
#define stm32wb_usbd_dcd_ep0_transmit  stm32wb_boot_usbd_dcd_ep0_transmit
#define stm32wb_usbd_dcd_pma_read      stm32wb_boot_usbd_dcd_pma_read
#define stm32wb_usbd_dcd_pma_write     stm32wb_boot_usbd_dcd_pma_write
#define stm32wb_usbd_dcd_reset         stm32wb_boot_usbd_dcd_reset

#define stm32wb_usbd_dcd_usb_interrupt stm32wb_boot_usbd_dcd_usb_interrupt
#define stm32wb_usbd_dcd_crs_interrupt stm32wb_boot_usbd_dcd_crs_interrupt

#include "stm32wb_usbd_dcd.c"

#define stm32wb_usbd_control           stm32wb_boot_usbd_control

#define stm32wb_usbd_bos               stm32wb_boot_usbd_bos
#define stm32wb_usbd_configuration     stm32wb_boot_usbd_configuration
#define stm32wb_usbd_configure         stm32wb_boot_usbd_configure
#define stm32wb_usbd_connect           stm32wb_boot_usbd_connect
#define stm32wb_usbd_device            stm32wb_boot_usbd_device
#define stm32wb_usbd_disable           stm32wb_boot_usbd_disable
#define stm32wb_usbd_disconnect        stm32wb_boot_usbd_disconnect
#define stm32wb_usbd_enable            stm32wb_boot_usbd_enable
#define stm32wb_usbd_event_callback    stm32wb_boot_usbd_event_callback
#define stm32wb_usbd_is_suspended      stm32wb_boot_usbd_is_suspended
#define stm32wb_usbd_language          stm32wb_boot_usbd_language
#define stm32wb_usbd_msos20            stm32wb_boot_usbd_msos20
#define stm32wb_usbd_request           stm32wb_boot_usbd_request
#define stm32wb_usbd_serial            stm32wb_boot_usbd_serial
#define stm32wb_usbd_set_address       stm32wb_boot_usbd_set_address
#define stm32wb_usbd_start             stm32wb_boot_usbd_start
#define stm32wb_usbd_state             stm32wb_boot_usbd_state
#define stm32wb_usbd_stop              stm32wb_boot_usbd_stop
#define stm32wb_usbd_string            stm32wb_boot_usbd_string
#define __svc_stm32wb_usbd_disable     __svc_stm32wb_boot_usbd_disable
#define __svc_stm32wb_usbd_enable      __svc_stm32wb_boot_usbd_enable
#define __svc_stm32wb_usbd_start       __svc_stm32wb_boot_usbd_start
#define __svc_stm32wb_usbd_stop        __svc_stm32wb_boot_usbd_stop

#include "stm32wb_usbd.h"

static void stm32wb_boot_dfu_configure(void *context, uint8_t interface);
static void stm32wb_boot_dfu_start(void *context);
static void stm32wb_boot_dfu_stop(void *context);
static int stm32wb_boot_dfu_request(void *context, int state, const stm32wb_usbd_request_t *request, uint8_t *data, const uint8_t **p_data_return, uint16_t *p_length_return, stm32wb_usbd_status_routine_t *p_status_routine_return);

#if (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1)
#define STM32WB_BOOT_DFU_CONFIGURATION_SIZE         (9 + (9+9+9))
#define STM32WB_BOOT_DFU_STRING_COUNT               2
#else /* (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1) */
#define STM32WB_BOOT_DFU_CONFIGURATION_SIZE         (9 + (9+9))
#define STM32WB_BOOT_DFU_STRING_COUNT               1
#endif /* (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1) */
#define STM32WB_BOOT_DFU_CLASS_COUNT                1
#define STM32WB_BOOT_DFU_INTERFACE_COUNT            1

static const uint8_t stm32wb_boot_dfu_configuration[STM32WB_BOOT_DFU_CONFIGURATION_SIZE] =
{
    /**** Configuration Descriptor ****/
    9,                                                           /* bLength */
    USB_DESCRIPTOR_TYPE_CONFIGURATION,                           /* bDescriptorType */
    STM32WB_BOOT_DFU_CONFIGURATION_SIZE & 255,                   /* wTotalLength */
    STM32WB_BOOT_DFU_CONFIGURATION_SIZE >> 8,
    1,                                                           /* bNumInterfaces */
    0x01,                                                        /* bConfigurationValue */
    0x02,                                                        /* iConfiguration */
    0x80,                                                        /* bmAttributes */
    0xfa,                                                        /* bMaxPower */

