GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
    /**** DFU Interface (Application) ****/
    9,                                                           /* bLength */
    0x04,                                                        /* bDescriptorType */
    0x00,                                                        /* bInterfaceNumber */
    0x00,                                                        /* bAlternateSetting */
    0x00,                                                        /* bNumEndpoints */
    0xfe,                                                        /* bInterfaceClass */
    0x01,                                                        /* bInterfaceSubClass */
    0x02,                                                        /* nInterfaceProtocol */
    0x04,                                                        /* iInterface */

#if (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1)
    /**** DFU Interface (Wireless) ****/
    9,                                                           /* bLength */
    0x04,                                                        /* bDescriptorType */
    0x00,                                                        /* bInterfaceNumber */
    0x01,                                                        /* bAlternateSetting */
    0x00,                                                        /* bNumEndpoints */
    0xfe,                                                        /* bInterfaceClass */
    0x01,                                                        /* bInterfaceSubClass */
    0x02,                                                        /* nInterfaceProtocol */
    0x05,                                                        /* iInterface */
#endif /* (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1) */
    
    /**** DFU Descriptor ****/
    0x09,                                                        /* blength = 9 Bytes */
    0x21,                                                        /* bDescriptorType */
    0x0d,                                                        /* bmAttribute */
    0xff, 0xff,                                                  /* wDetachTimeOut= 255 ms */
    0x00, 0x04,                                                  /* wTransferSize = 1024 Bytes */
    0x10, 0x01,                                                  /* bcdDFUVersion */
};

static const char * const stm32wb_boot_dfu_strings[STM32WB_BOOT_DFU_STRING_COUNT] =
{
    "STM32WB Application",                    // 4
#if (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1)
    "STM32WB Wireless",                       // 5
#endif /* (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1) */
};

static const uint8_t stm32wb_boot_dfu_bos[] = {
    // BOS
    0x05,                                            // bLength
    USB_DESCRIPTOR_TYPE_BOS,                         // bDescriptorType
    0x21, 0x00,                                      // wTotalLength
    0x01,                                            // bNumDeviceCaps

    // Microsoft OS 2.0 platform capability
    0x1c,                                            // bLength
    USB_DESCRIPTOR_TYPE_DEVICE_CAPABILITY,           // bDescriptorType
    USB_DEVICE_CAPABILITY_TYPE_PLATFORM,             // bDevCapabilityType
    0x00,                                            // bReserved
    0xdf, 0x60, 0xdd, 0xd8, 0x89, 0x45, 0xc7, 0x4c,  // platformCapabilityUUID[16]     
    0x9c, 0xd2, 0x65, 0x9d, 0x9e, 0x64, 0x8a, 0x9f,  // platformCapabilityUUID[16]     
    0x00, 0x00, 0x03, 0x06,                          // dwWindowsVersion (Windows 8.1)
    0xb2, 0x00,                                      // wLength (MSOS20)
    USB_REQ_MS_VENDOR_CODE,                          // bMS_VendorCode
    0x00,                                            // bAltEnumCode
};

static const uint8_t stm32wb_boot_dfu_msos20[] = {
    // Microsoft OS 2.0 descriptor set header
    0x0a, 0x00,                                      // wLength
    0x00, 0x00,                                      // wDescriptorType
    0x00, 0x00, 0x03, 0x06,                          // dwWindowsVersion (Windows 8.1)
    0xb2, 0x00,                                      // wTotalLength

    // Microsoft OS 2.0 configuration subset header
    0x08, 0x00,                                      // wLength
    0x01, 0x00,                                      // wDescriptorType
    0x00,                                            // bConfigurationValue
    0x00,                                            // bReserved
    0xa8, 0x00,                                      // wTotalLength (size of entire configuration subset)

    // Microsoft OS 2.0 function subset header
    0x08, 0x00,                                      // wLength
    0x02, 0x00,                                      // wDescriptorType
    0x00,                                            // bFirstInterface
    0x00,                                            // bReserved
    0xa0, 0x00,                                      // wTotalLength  (size of entine function subset)

    // Microsoft OS 2.0 compatible ID
    0x14, 0x00,                                      // wLength
    0x03, 0x00,                                      // wDescriptorType
    'W',  'I',  'N',  'U',  'S',  'B',  0x00, 0x00,  // compatible ID
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,  // subCompatibleID
                                        
    // Microsoft OS 2.0 registry property
    0x84, 0x00,                                      // wLength
    0x04, 0x00,                                      // wDescriptorType
    0x07, 0x00,                                      // wPropertyDataType
    0x2a, 0x00,                                      // wPropertyNameLength
    'D',  0x00, 'e',  0x00, 'v',  0x00, 'i',  0x00,  // bPropertyName "DeviceInterfaceGUIDs"
    'c',  0x00, 'e',  0x00, 'I',  0x00, 'n',  0x00,    
    't',  0x00, 'e',  0x00, 'r',  0x00, 'f',  0x00,    
    'a',  0x00, 'c',  0x00, 'e',  0x00, 'G',  0x00,    
    'U',  0x00, 'I',  0x00, 'D',  0x00, 's',  0x00,        
    0x00, 0x00,
    0x50, 0x00,                                      // wPropertyDataLength
    '{',  0x00, 'D',  0x00, 'E',  0x00, '5',  0x00,  // bProperyData "{DE50DD7B-4DEF-4F9F-98AA-88144B16A383}"
    '0',  0x00, 'D',  0x00, 'D',  0x00, '7',  0x00,
    'B',  0x00, '-',  0x00, '4',  0x00, 'D',  0x00,
    'E',  0x00, 'F',  0x00, '-',  0x00, '4',  0x00,
    'F',  0x00, '9',  0x00, 'F',  0x00, '-',  0x00,
    '9',  0x00, '8',  0x00, 'A',  0x00, 'A',  0x00,
    '-',  0x00, '8',  0x00, '8',  0x00, '1',  0x00,
    '4',  0x00, '4',  0x00, 'B',  0x00, '1',  0x00,
    '6',  0x00, 'A',  0x00, '3',  0x00, '8',  0x00,
    '3',  0x00, '}',  0x00,
    0x00, 0x00, 0x00, 0x00,
};

static const stm32wb_usbd_device_t stm32wb_boot_dfu_device =
{
    0x0483,
    0xdf11,
    0x0200,
    "STMicroelectronics",
    "STM32WB in DFU Mode",
};

#define stm32wb_boot_dfu_ep0_data stm32wb_boot_io2_data

#include "stm32wb_usbd.c"

