GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
#define DFU_ALTSETTING_APPLICATION       0
#define DFU_ALTSETTING_WIRELESS          1

#define DFU_REQUEST_DETACH               0x00
#define DFU_REQUEST_DNLOAD               0x01
#define DFU_REQUEST_UPLOAD               0x02
#define DFU_REQUEST_GETSTATUS            0x03
#define DFU_REQUEST_CLRSTATUS            0x04
#define DFU_REQUEST_GETSTATE             0x05
#define DFU_REQUEST_ABORT                0x06

#define DFU_STATUS_OK                    0x00
#define DFU_STATUS_ERR_TARGET            0x01
#define DFU_STATUS_ERR_FILE              0x02
#define DFU_STATUS_ERR_WRITE             0x03
#define DFU_STATUS_ERR_ERASE             0x04
#define DFU_STATUS_ERR_CHECK_ERASED      0x05
#define DFU_STATUS_ERR_PROG              0x06
#define DFU_STATUS_ERR_VERIFY            0x07
#define DFU_STATUS_ERR_ADDRESS           0x08
#define DFU_STATUS_ERR_NOTDONE           0x09
#define DFU_STATUS_ERR_FIRMWARE          0x0a
#define DFU_STATUS_ERR_VENDOR            0x0b
#define DFU_STATUS_ERR_USBR              0x0c
#define DFU_STATUS_ERR_POR               0x0d
#define DFU_STATUS_ERR_UNKNOWN           0x0e
#define DFU_STATUS_ERR_STALLEDPKT        0x0f

#define DFU_STATE_APP_IDLE               0
#define DFU_STATE_APP_DETACH             1
#define DFU_STATE_IDLE                   2
#define DFU_STATE_DNLOAD_SYNC            3
#define DFU_STATE_DNBUSY                 4
#define DFU_STATE_DNLOAD_IDLE            5
#define DFU_STATE_MANIFEST_SYNC          6
#define DFU_STATE_MANIFEST               7
#define DFU_STATE_MANIFEST_WAIT_RESET    8
#define DFU_STATE_UPLOAD_IDLE            9
#define DFU_STATE_ERROR                  10

typedef struct _stm32wb_boot_dfu_control_t {
    uint8_t                       interface;
    uint8_t                       altsetting;
    volatile uint8_t              status;
    volatile uint8_t              state;

    volatile uint32_t             events;

    uint32_t                      erase_address;
    uint32_t                      erase_size;
    uint32_t                      erase_time;
    uint32_t                      program_address;
    uint32_t                      program_size;
    uint32_t                      program_time;
    uint32_t                      boot_size;
    uint32_t                      application_size;
    uint32_t                      image_size;
    uint32_t                      image_count;
    uint8_t                       *image_data;
#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1)
    uint32_t                      application_info;
    stm32wb_boot_aes128_context_t aes128_ctx;
    uint32_t                      aes128_iv[4];
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1) */
} stm32wb_boot_dfu_control_t;

static stm32wb_boot_dfu_control_t stm32wb_boot_dfu_control;

#define STM32WB_DFU_PROGRAM_SIZE       1024

#define STM32WB_DFU_EVENT_START        0x00000001
#define STM32WB_DFU_EVENT_WRITE        0x00000002
#define STM32WB_DFU_EVENT_FINISH       0x00000004
#define STM32WB_DFU_EVENT_DETACH       0x00000008

static void stm32wb_boot_dfu_detach()
{
    __armv7m_atomic_or(&stm32wb_boot_dfu_control.events, STM32WB_DFU_EVENT_DETACH);
}

static void stm32wb_boot_dfu_dnload()
{
    uint32_t events;

    events = STM32WB_DFU_EVENT_WRITE;
    
#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1)
    if (stm32wb_boot_dfu_control.erase_address == stm32wb_boot_info.application_base)
#else /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1) */
    if (stm32wb_boot_dfu_control.erase_address == stm32wb_boot_info.fwu_base)
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1) */
    {
        events |= STM32WB_DFU_EVENT_START;
    }

    __armv7m_atomic_or(&stm32wb_boot_dfu_control.events, events);
}

static void stm32wb_boot_dfu_manifest()
{
    uint32_t events;

    events = STM32WB_DFU_EVENT_FINISH;

    if (stm32wb_boot_dfu_control.image_count)
    {
        events |= STM32WB_DFU_EVENT_WRITE;
    }

    __armv7m_atomic_or(&stm32wb_boot_dfu_control.events, events);
}

static void stm32wb_boot_dfu_configure(void *context, uint8_t interface)
{
    stm32wb_boot_dfu_control.interface = interface;
}

static void stm32wb_boot_dfu_start(void *context)
{
    stm32wb_boot_dfu_control.altsetting = DFU_ALTSETTING_APPLICATION;
}

static void stm32wb_boot_dfu_stop(void *context)
{
}

static int stm32wb_boot_dfu_request(void *context, int state, const stm32wb_usbd_request_t *request, uint8_t *data, const uint8_t **p_data_return, uint16_t *p_length_return, stm32wb_usbd_status_routine_t *p_status_routine_return)
{
    uint16_t interface;
    int status, dfu_state, dfu_status, dfu_timeout;
    uint32_t application_size, application_length, image_offset, image_skip, signature_size;
    const stm32wb_fwu_prefix_t *application_prefix;
#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1)
    uint32_t aes128_key[4];
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1) */

    status = STM32WB_USBD_REQUEST_STATUS_UNHANDLED;
    
    switch (request->bmRequestType & USB_REQ_RECIPIENT_MASK) {
    case USB_REQ_RECIPIENT_INTERFACE: {
	interface = request->wIndex;
	
	if (interface == stm32wb_boot_dfu_control.interface)
	{
	    switch (request->bmRequestType & USB_REQ_TYPE_MASK) {
            case USB_REQ_TYPE_STANDARD: {
                switch (request->bRequest) {
                case USB_REQ_CODE_GET_INTERFACE: {
                    *p_data_return = data;
                    *p_length_return = 1;
                        
                    data[0] = stm32wb_boot_dfu_control.altsetting;
                    
                    status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                    break;
                }
                            
                case USB_REQ_CODE_SET_INTERFACE: {
#if (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1)
                    if ((request->wValue == 0) || (request->wValue == 1))
#else /* (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1) */
                    if (request->wValue == 0)
#endif /* (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1) */
                    {
                        stm32wb_boot_dfu_control.altsetting = request->wValue;

                        status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                    }
                    break;
                }

                default:
                    break;
                }
                break;
            }
                
	    case USB_REQ_TYPE_CLASS: {
                dfu_state = DFU_STATE_ERROR;
                dfu_status = DFU_STATUS_ERR_STALLEDPKT;
                
		switch (request->bRequest) {
                    
                case DFU_REQUEST_DETACH: {
                    *p_status_routine_return = stm32wb_boot_dfu_detach;
                        
                    status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                    break;
                }
                    
