GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
                case DFU_REQUEST_DNLOAD: {     
                    if ((stm32wb_boot_dfu_control.state == DFU_STATE_IDLE) || (stm32wb_boot_dfu_control.state == DFU_STATE_DNLOAD_IDLE))
                    {
                        if (stm32wb_boot_dfu_control.state == DFU_STATE_IDLE)
                        {
#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1)
                            stm32wb_boot_dfu_control.erase_address = stm32wb_boot_info.application_base;
                            stm32wb_boot_dfu_control.program_address = stm32wb_boot_info.application_base;
#else /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1) */
                            stm32wb_boot_dfu_control.erase_address = stm32wb_boot_info.fwu_base;
                            stm32wb_boot_dfu_control.program_address = stm32wb_boot_info.fwu_base;
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1) */
                            stm32wb_boot_dfu_control.boot_size = 0;
                            stm32wb_boot_dfu_control.application_size = 0;
                            stm32wb_boot_dfu_control.image_size = 0;
                            stm32wb_boot_dfu_control.image_count = 0;
#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1)
                            stm32wb_boot_dfu_control.application_info = 0;
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1) */
                        }

                        if (request->wLength)
                        {
                            stm32wb_boot_memcpy(&stm32wb_boot_dfu_control.image_data[stm32wb_boot_dfu_control.image_count], data, request->wLength);

                            stm32wb_boot_dfu_control.image_size += request->wLength;
                            stm32wb_boot_dfu_control.image_count += request->wLength;

                            image_offset = stm32wb_boot_dfu_control.image_size - stm32wb_boot_dfu_control.image_count;

                            if (stm32wb_boot_dfu_control.altsetting == DFU_ALTSETTING_APPLICATION)
                            {
                                if ((image_offset == stm32wb_boot_dfu_control.boot_size) && (stm32wb_boot_dfu_control.image_count >= sizeof(stm32wb_application_vectors_t)))
                                {
                                    if ((image_offset == 0) &&
                                        (((const stm32wb_boot_vectors_t*)&stm32wb_boot_dfu_control.image_data[0])->magic == ((const stm32wb_boot_vectors_t*)stm32wb_boot_vectors)->magic) &&
                                        (((const stm32wb_boot_vectors_t*)&stm32wb_boot_dfu_control.image_data[0])->base == ((const stm32wb_boot_vectors_t*)stm32wb_boot_vectors)->base) &&
                                        (((const stm32wb_boot_vectors_t*)&stm32wb_boot_dfu_control.image_data[0])->size == ((const stm32wb_boot_vectors_t*)stm32wb_boot_vectors)->size))
                                    {
                                        stm32wb_boot_dfu_control.boot_size = ((const stm32wb_boot_vectors_t*)stm32wb_boot_vectors)->size;
                                    }
                                    else
                                    {
                                        if (((const stm32wb_application_vectors_t*)stm32wb_boot_vectors)->magic & STM32WB_BOOT_OPTION_SIGNATURE_MASK)
                                        {
                                            signature_size = STM32WB_APPLICATION_SIGNATURE_SIZE_ECC256;
                                        }
                                        else
                                        {
                                            signature_size = STM32WB_APPLICATION_SIGNATURE_SIZE_NONE;
                                        }
                                      
                                        if ((((const stm32wb_application_vectors_t*)&stm32wb_boot_dfu_control.image_data[0])->magic == ((((const stm32wb_boot_vectors_t*)stm32wb_boot_vectors)->magic & ~STM32WB_BOOT_TYPE_MASK) | STM32WB_APPLICATION_TYPE_APPLICATION)) &&
                                            (((const stm32wb_application_vectors_t*)&stm32wb_boot_dfu_control.image_data[0])->base == stm32wb_boot_info.application_base))
                                        {
                                            application_size = ((const stm32wb_application_vectors_t*)&stm32wb_boot_dfu_control.image_data[0])->size;
                                            
                                            if ((application_size >= (sizeof(stm32wb_application_vectors_t) + sizeof(stm32wb_application_info_t))) &&
                                                ((application_size + signature_size) <= (stm32wb_boot_info.application_limit - stm32wb_boot_info.application_base)) &&
                                                !(application_size & 15))
                                            {
                                                stm32wb_boot_dfu_control.application_size = application_size + signature_size;
                                            }
                                        }
                                        
#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1)
                                        if (((const stm32wb_fwu_prefix_t*)&stm32wb_boot_dfu_control.image_data[0])->magic == ((((const stm32wb_boot_vectors_t*)stm32wb_boot_vectors)->magic & ~(STM32WB_BOOT_TAG_MASK | STM32WB_BOOT_TYPE_MASK)) | STM32WB_FWU_TAG_FWU))
#else /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1) */
                                            if ((((const stm32wb_fwu_prefix_t*)&stm32wb_boot_dfu_control.image_data[0])->magic & ~STM32WB_FWU_TYPE_MASK) == ((((const stm32wb_boot_vectors_t*)stm32wb_boot_vectors)->magic & ~(STM32WB_BOOT_TAG_MASK | STM32WB_BOOT_TYPE_MASK)) | STM32WB_FWU_TAG_FWU))
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1) */
                                        {
                                            application_prefix = ((const stm32wb_fwu_prefix_t*)&stm32wb_boot_dfu_control.image_data[0]);
                                            
                                            application_size = application_prefix->size;
                                            application_length = application_prefix->length; 
                                            
                                            if ((application_size >= (sizeof(stm32wb_application_vectors_t) + sizeof(stm32wb_application_info_t))) &&
                                                ((application_size + signature_size) <= (stm32wb_boot_info.application_limit - stm32wb_boot_info.application_base)) &&
                                                !(application_size & 15) &&
                                                !(application_length & 15))
                                            {
                                                stm32wb_boot_dfu_control.application_size = sizeof(stm32wb_fwu_prefix_t) + application_length;

