GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1)
                                                if (signature_size)
                                                {
                                                    stm32wb_boot_dfu_control.application_info = stm32wb_boot_info.application_base;
                                                    
                                                    stm32wb_boot_dfu_control.application_info += (application_size - sizeof(stm32wb_application_info_t));
                                                    
                                                    stm32wb_boot_aes128_get_key(&application_prefix->nonce[0], &aes128_key[0]);
                                                    
                                                    stm32wb_boot_aes128_set_key(&stm32wb_boot_dfu_control.aes128_ctx, &aes128_key[0]);
                                                    
                                                    stm32wb_boot_dfu_control.aes128_iv[0] = 0;
                                                    stm32wb_boot_dfu_control.aes128_iv[1] = 0;
                                                    stm32wb_boot_dfu_control.aes128_iv[2] = 0;
                                                    stm32wb_boot_dfu_control.aes128_iv[3] = 0;
                                                }
                                                else
                                                {
                                                    stm32wb_boot_dfu_control.application_info = 0x00000000;
                                                }
                                                
                                                stm32wb_boot_dfu_control.image_count -= sizeof(stm32wb_fwu_prefix_t);
                                                
                                                stm32wb_boot_memcpy(&stm32wb_boot_dfu_control.image_data[0], &stm32wb_boot_dfu_control.image_data[sizeof(stm32wb_fwu_prefix_t)], stm32wb_boot_dfu_control.image_count);
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1) */
                                            }
                                        }
                                    }
                                    
                                    if ((stm32wb_boot_dfu_control.boot_size == 0) && (stm32wb_boot_dfu_control.application_size == 0))
                                    {
                                        dfu_state = DFU_STATE_ERROR;
                                        dfu_status = DFU_STATUS_ERR_FILE;
                                        
                                        status = STM32WB_USBD_REQUEST_STATUS_FAILURE;
                                    }
                                }
                                    
                                if ((stm32wb_boot_dfu_control.boot_size != 0) || (stm32wb_boot_dfu_control.application_size != 0))
                                {
                                    if (status != STM32WB_USBD_REQUEST_STATUS_FAILURE)
                                    {
                                        if (stm32wb_boot_dfu_control.image_size > (stm32wb_boot_dfu_control.boot_size + stm32wb_boot_dfu_control.application_size))
                                        {
                                            dfu_state = DFU_STATE_ERROR;
                                            dfu_status = DFU_STATUS_ERR_ADDRESS;
                                                
                                            status = STM32WB_USBD_REQUEST_STATUS_FAILURE;
                                        }
                                    }
                                        
                                    if (status != STM32WB_USBD_REQUEST_STATUS_FAILURE)
                                    {
                                        if (stm32wb_boot_dfu_control.boot_size > image_offset)
                                        {
                                            image_skip = (stm32wb_boot_dfu_control.boot_size - image_offset);

                                            if (image_skip > stm32wb_boot_dfu_control.image_count)
                                            {
                                                image_skip = stm32wb_boot_dfu_control.image_count;
                                            }
                                            
                                            stm32wb_boot_dfu_control.image_count -= image_skip;
                                                
                                            if (stm32wb_boot_dfu_control.image_count)
                                            {
                                                stm32wb_boot_memcpy(&stm32wb_boot_dfu_control.image_data[0],
                                                                    &stm32wb_boot_dfu_control.image_data[image_skip],
                                                                    stm32wb_boot_dfu_control.image_count);
                                            }
                                                
                                            dfu_state = DFU_STATE_DNLOAD_IDLE;
                                            dfu_status = DFU_STATUS_OK;
                                        }
                                        else
                                        {
                                            dfu_state = DFU_STATE_DNLOAD_SYNC;
                                            dfu_status = DFU_STATUS_OK;
                                        }
                                            
                                        status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                                    }
                                }
                            }
#if (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1)
                            else
                            {
                                if (((const stm32wb_boot_vectors_t*)stm32wb_boot_vectors)->magic & STM32WB_BOOT_OPTION_PROTECTED)
                                {
                                    dfu_state = DFU_STATE_ERROR;
                                    dfu_status = DFU_STATUS_ERR_FILE;
                                    
