GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
                                    status = STM32WB_USBD_REQUEST_STATUS_FAILURE;
                                }
                                else
                                {
                                    if (stm32wb_boot_dfu_control.image_size > (stm32wb_boot_info.fwu_limit - stm32wb_boot_info.fwu_base - STM32WB_BOOT_WIRELESS_PREFIX_SIZE))
                                    {
                                        dfu_state = DFU_STATE_ERROR;
                                        dfu_status = DFU_STATUS_ERR_ADDRESS;
                                        
                                        status = STM32WB_USBD_REQUEST_STATUS_FAILURE;
                                    }
                                    else
                                    {
                                        dfu_state = DFU_STATE_DNLOAD_SYNC;
                                        dfu_status = DFU_STATUS_OK;
                                        
                                        status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                                    }
                                }
                            }
#endif /* (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1) */
                            
                        }
                        else
                        {
                            if (stm32wb_boot_dfu_control.altsetting == DFU_ALTSETTING_APPLICATION)
                            {
                                if (stm32wb_boot_dfu_control.application_size == 0)
                                {
                                    dfu_state = DFU_STATE_ERROR;
                                    dfu_status = DFU_STATUS_ERR_FILE;
                                    
                                    status = STM32WB_USBD_REQUEST_STATUS_FAILURE;
                                }
                                else
                                {
                                    if (stm32wb_boot_dfu_control.image_size != (stm32wb_boot_dfu_control.boot_size + stm32wb_boot_dfu_control.application_size))
                                    {
                                        dfu_state = DFU_STATE_ERROR;
                                        dfu_status = DFU_STATUS_ERR_NOTDONE;
                                        
                                        status = STM32WB_USBD_REQUEST_STATUS_FAILURE;
                                    }
                                }
                            }
                                
                            if (status != STM32WB_USBD_REQUEST_STATUS_FAILURE)
                            {
                                dfu_state = DFU_STATE_MANIFEST_SYNC;
                                dfu_status = DFU_STATUS_OK;
                                    
                                status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                            }
                        }
                    }
                    else
                    {
                        status = STM32WB_USBD_REQUEST_STATUS_FAILURE;
                    }
                    break;
                }

                case DFU_REQUEST_UPLOAD: {     
                    status = STM32WB_USBD_REQUEST_STATUS_FAILURE;
                    break;
                }
                    
                case DFU_REQUEST_GETSTATUS: {
                    dfu_state = stm32wb_boot_dfu_control.state;
                    dfu_status = stm32wb_boot_dfu_control.status;
                    dfu_timeout = 0;
                    
                    *p_data_return = data;
                    *p_length_return = 6;

                    if (dfu_state == DFU_STATE_DNBUSY)
                    {
                        dfu_timeout = 5;
                    }

                    if (dfu_state == DFU_STATE_DNLOAD_SYNC)
                    {
                        if (stm32wb_boot_dfu_control.image_count >= STM32WB_DFU_PROGRAM_SIZE)
                        {
                            dfu_state = DFU_STATE_DNBUSY;
                        
                            *p_status_routine_return = stm32wb_boot_dfu_dnload;
                            
                            dfu_timeout += stm32wb_boot_dfu_control.program_time;
                            
                            if (stm32wb_boot_dfu_control.erase_address == stm32wb_boot_info.fwu_base)
                            {
                                dfu_timeout += STM32WB_BOOT_FLASH_ERASE_TIME;
                            }
                            
                            if (stm32wb_boot_dfu_control.erase_address == stm32wb_boot_dfu_control.program_address)
                            {
                                dfu_timeout += stm32wb_boot_dfu_control.erase_time;
                            }
                        }
                        else
                        {
                            dfu_state = DFU_STATE_DNLOAD_IDLE;
                        }
                    }

                    if (dfu_state == DFU_STATE_MANIFEST)
                    {
                        dfu_timeout = 250;
                    }

                    if (dfu_state == DFU_STATE_MANIFEST_SYNC)
                    {
                        *p_status_routine_return = stm32wb_boot_dfu_manifest;

                        dfu_state = DFU_STATE_MANIFEST;

                        dfu_timeout = 250;
                    }

                    data[0] = dfu_status;
                    data[1] = dfu_timeout >> 0;
                    data[2] = dfu_timeout >> 8;
                    data[3] = dfu_timeout >> 16;
                    data[4] = dfu_state;
                    data[5] = 0;

                    status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                    break;
                }
                    
                case DFU_REQUEST_CLRSTATUS: {
                    if (stm32wb_boot_dfu_control.state == DFU_STATE_ERROR)
                    {
                        dfu_state = DFU_STATE_IDLE;
                        dfu_status = DFU_STATUS_OK;

                        status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                    }
                    else
                    {
                        dfu_state = DFU_STATE_ERROR;
                        dfu_status = stm32wb_boot_dfu_control.status;
                        
