GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
                        status = STM32WB_USBD_REQUEST_STATUS_FAILURE;
                    }
                    break;
                }
                    
                case DFU_REQUEST_GETSTATE: {
                    dfu_state = stm32wb_boot_dfu_control.state;
                    dfu_status = stm32wb_boot_dfu_control.status;

                    *p_data_return = data;
                    *p_length_return = 1;

                    data[0] = dfu_state;
                    
                    status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                    break;
                }
                    
                case DFU_REQUEST_ABORT: {
                    if ((stm32wb_boot_dfu_control.state == DFU_STATE_IDLE) || (stm32wb_boot_dfu_control.state == DFU_STATE_DNLOAD_IDLE))
                    {
                        dfu_state = DFU_STATE_IDLE;
                        dfu_status = DFU_STATUS_OK;

                        status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                    }
                    else
                    {
                        status = STM32WB_USBD_REQUEST_STATUS_FAILURE;
                    }
                    break;
                }
                    
		default:
		    break;
		}

                if (status != STM32WB_USBD_REQUEST_STATUS_UNHANDLED)
                {
                    stm32wb_boot_dfu_control.state = dfu_state;
                    stm32wb_boot_dfu_control.status = dfu_status;
                }
		break;
	    }

	    default:
		break;
	    }
	}
	break;
    }
	
    default:
	break;
    }
    
    return status;
}

static void __attribute__((noreturn, noinline)) stm32wb_boot_dfu(const stm32wb_application_info_t *application_info)
{
    uint32_t events, size, count, data[8];
    uint8_t dfu_state, dfu_status;
    
    RTC->WPR = 0xca;
    RTC->WPR = 0x53;
                    
    RTC->BKP16R = ((RTC->BKP16R & ~(STM32WB_RTC_BKP16R_DFU)) | ((STM32WB_RTC_BKP16R_DFU) << STM32WB_RTC_BKP16R_NOT_DATA_SHIFT));
    
    RTC->WPR = 0x00;
    
#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 0)
#if (STM32WB_BOOT_FWU_CONFIG_SFLASH == 1)
    if (stm32wb_boot_info.fwu_base < STM32WB_BOOT_SFLASH_LIMIT)
    {
        const stm32wb_boot_sflash_info_t *sflash_info;

        sflash_info = stm32wb_boot_sflash_init();

        stm32wb_boot_dfu_control.erase_size = sflash_info->erase_size;
        stm32wb_boot_dfu_control.program_size = sflash_info->page_size;
    }
    else
#endif /* (STM32WB_BOOT_FWU_CONFIG_SFLASH == 1) */
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 0) */
    {
        stm32wb_boot_dfu_control.erase_size = STM32WB_BOOT_FLASH_ERASE_SIZE;
        stm32wb_boot_dfu_control.program_size = STM32WB_BOOT_FLASH_PROGRAM_SIZE;
    }

    stm32wb_boot_dfu_control.erase_time = STM32WB_BOOT_FLASH_ERASE_TIME;
    stm32wb_boot_dfu_control.program_time = (((STM32WB_DFU_PROGRAM_SIZE / STM32WB_BOOT_FLASH_PROGRAM_SIZE) * STM32WB_BOOT_FLASH_PROGRAM_TIME) + 999) / 1000;
    
    if (application_info)
    {
#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 0)
        if (stm32wb_boot_fwu_state() == STM32WB_FWU_STATE_FAILED)
        {
            stm32wb_boot_dfu_control.status = ((const uint8_t*)(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_FAILED))[0];
            stm32wb_boot_dfu_control.state = DFU_STATE_ERROR;
        }
        else
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 0) */
        {
            stm32wb_boot_dfu_control.status = DFU_STATUS_OK;
            stm32wb_boot_dfu_control.state = DFU_STATE_IDLE;
        }
    }
    else
    {
        stm32wb_boot_dfu_control.status = DFU_STATUS_ERR_FIRMWARE;
        stm32wb_boot_dfu_control.state = DFU_STATE_ERROR;
    }

    stm32wb_boot_dfu_control.image_data = &stm32wb_boot_io8_data[0];
    
    stm32wb_usbd_configure(&stm32wb_boot_dfu_device, NULL);
    
    stm32wb_usbd_enable();
    
    while (1)
    {
        __WFE();
        
        events = __armv7m_atomic_swap(&stm32wb_boot_dfu_control.events, 0);
        
        if (events)
        {
            dfu_state = stm32wb_boot_dfu_control.state;
            dfu_status = stm32wb_boot_dfu_control.status;
            
            if (events & STM32WB_DFU_EVENT_START)
            {
#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 0)
                if (!stm32wb_boot_flash_erase(stm32wb_boot_info.fwu_status))
                {
                    dfu_status = DFU_STATUS_ERR_ERASE;
                }

                if (dfu_status == DFU_STATUS_OK)
                {
                    data[0] = 0x00000000;
                    data[1] = 0x00000000;
                        
                    if (!stm32wb_boot_flash_program(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_READY, (const uint8_t*)&data[0], 8))
                    {
                        dfu_status = DFU_STATUS_ERR_PROG;
                    }
                }

                if (dfu_status == DFU_STATUS_OK)
                {
#if (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1)
                    data[0] = (stm32wb_boot_dfu_control.altsetting == DFU_ALTSETTING_APPLICATION) ? STM32WB_FWU_COMPONENT_APPLICATION : STM32WB_FWU_COMPONENT_WIRELESS;
#else /* (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1) */
                    data[0] = STM32WB_FWU_COMPONENT_APPLICATION;
#endif /* (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1) */
                    data[1] = 0x00000000;
                        
                    if (!stm32wb_boot_flash_program(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_WRITING, (const uint8_t*)&data[0], 8))
                    {
                        dfu_status = DFU_STATUS_ERR_PROG;
                    }
                }
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 0) */
            }

            if (events & STM32WB_DFU_EVENT_WRITE)
            {
                size = STM32WB_DFU_PROGRAM_SIZE;
                
                if (size > stm32wb_boot_dfu_control.image_count)
                {
                    size = stm32wb_boot_dfu_control.image_count;
                }
                
