GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_boot.c
#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1)
                if (stm32wb_boot_dfu_control.altsetting == DFU_ALTSETTING_APPLICATION)
                {
                    if (stm32wb_boot_dfu_control.program_address < stm32wb_boot_dfu_control.application_info)
                    {
                        count = size;
                        
                        if (count > (stm32wb_boot_dfu_control.application_info - stm32wb_boot_dfu_control.program_address))
                        {
                            count = (stm32wb_boot_dfu_control.application_info - stm32wb_boot_dfu_control.program_address);
                        }
                        
                        if (count)
                        {
                            stm32wb_boot_dfu_control.aes128_iv[3] = SWAP((stm32wb_boot_dfu_control.program_address - stm32wb_boot_info.application_base) / 16);
                            
                            stm32wb_boot_aes128_ctr_encrypt(&stm32wb_boot_dfu_control.aes128_ctx, &stm32wb_boot_dfu_control.aes128_iv[0], (const uint32_t*)&stm32wb_boot_dfu_control.image_data[0], (uint32_t*)&stm32wb_boot_dfu_control.image_data[0], count);
                        }
                    }
                }
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1) */
                
                if (dfu_status == DFU_STATUS_OK)
                {
                    if (stm32wb_boot_dfu_control.erase_address == stm32wb_boot_dfu_control.program_address)
                    {
                        if (!stm32wb_boot_nvm_erase(stm32wb_boot_dfu_control.erase_address))
                        {
                            dfu_status = DFU_STATUS_ERR_ERASE;
                        }
                        else
                        {
                            stm32wb_boot_dfu_control.erase_address += stm32wb_boot_dfu_control.erase_size;
                        }
                    }
                }

                if (dfu_status == DFU_STATUS_OK)
                {
#if (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1)
                    if (stm32wb_boot_dfu_control.altsetting == DFU_ALTSETTING_WIRELESS)
                    {
#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1)
                        if (stm32wb_boot_dfu_control.program_address == stm32wb_boot_info.application_base)
#else /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1) */
                        if (stm32wb_boot_dfu_control.program_address == stm32wb_boot_info.fwu_base)
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1) */
                        {
                            stm32wb_boot_dfu_control.program_address += STM32WB_BOOT_WIRELESS_PREFIX_SIZE;

                            size -= STM32WB_BOOT_WIRELESS_PREFIX_SIZE;
                        }
                    }
#endif /* (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1) */
                    
                    dfu_state = DFU_STATE_DNLOAD_IDLE;
                    
                    for (; size; size -= count)
                    {
                        count = stm32wb_boot_dfu_control.program_size;

                        if (count > size)
                        {
                            count = size;
                        }
                    
                        if (!stm32wb_boot_nvm_program(stm32wb_boot_dfu_control.program_address, &stm32wb_boot_dfu_control.image_data[0], ((count + 15) & ~15), false))
                        {
                            dfu_status = DFU_STATUS_ERR_PROG;

                            break;
                        }

                        stm32wb_boot_dfu_control.program_address += count;
                        
                        stm32wb_boot_dfu_control.image_count -= count;
                        
                        if (stm32wb_boot_dfu_control.image_count)
                        {
                            stm32wb_boot_memcpy(&stm32wb_boot_dfu_control.image_data[0],
                                                &stm32wb_boot_dfu_control.image_data[count],
                                                stm32wb_boot_dfu_control.image_count);
                        }
                    }
                }
            }
            
            if (events & STM32WB_DFU_EVENT_FINISH)
            {
#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 0)
                if (dfu_status == DFU_STATUS_OK)
                {
                    data[0] = stm32wb_boot_dfu_control.image_size;
                    data[1] = 0;
                    
                    if (!stm32wb_boot_flash_program(stm32wb_boot_info.fwu_status + STM32WB_FWU_STATUS_OFFSET_CANDIDATE, (const uint8_t*)&data[0], 8))
                    {
                        dfu_status = DFU_STATUS_ERR_PROG;
                    }
                }
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 0) */
            
                if (dfu_status == DFU_STATUS_OK)
                {
#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1)
#if (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1)
                    if (stm32wb_boot_dfu_control.altsetting == DFU_ALTSETTING_WIRELESS)
                    {
                        data[0] = stm32wb_boot_dfu_control.image_size;
                        data[1] = STM32WB_BOOT_WIRELESS_PREFIX_MAGIC;
                    
                        if (!stm32wb_boot_flash_program(stm32wb_boot_info.application_base, (const uint8_t*)&data[0], 8))
                        {
                            dfu_status = DFU_STATUS_ERR_PROG;
                        }
                    }
#endif /* (STM32WB_BOOT_DFU_CONFIG_WIRELESS == 1) */
#else /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1) */
                    data[0] = dfu_status; // DFU_STATUSOK == STM32WB_FWU_MODE_ACCEPT ...
                    data[1] = 0x00000000; 
                    
                    if (!stm32wb_boot_flash_program(stm32wb_boot_info.fwu_status + ((dfu_status == DFU_STATUS_OK) ? STM32WB_FWU_STATUS_OFFSET_STAGED : STM32WB_FWU_STATUS_OFFSET_FAILED), (const uint8_t*)&data[0], 8))
                    {
                        dfu_status = DFU_STATUS_ERR_PROG;
                    }
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 0) */
                }
                    
                if (dfu_status == DFU_STATUS_OK)
                {
                    if (stm32wb_boot_dfu_control.altsetting == DFU_ALTSETTING_APPLICATION)
                    {
#if (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1)
                        if (!stm32wb_boot_application_info())
                        {
                            dfu_status = DFU_STATUS_ERR_FILE;
                        }
#else /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1) */
                        dfu_status = stm32wb_boot_fwu_install(application_info);
#endif /* (STM32WB_BOOT_DFU_CONFIG_STANDALONE == 1) */
                    }
                }
                
                dfu_state = DFU_STATE_IDLE;
            }
            
            if (events & STM32WB_DFU_EVENT_DETACH)
            {
                stm32wb_usbd_disable();
                
                stm32wb_boot_reset();
            }
            
            if (dfu_status != DFU_STATUS_OK)
            {
                dfu_state = DFU_STATE_ERROR;
            }
            
            stm32wb_boot_dfu_control.status = dfu_status;
            stm32wb_boot_dfu_control.state = dfu_state;
        }
    }
}

/************************************************************************************************************************************/
